//2016.02.28, czs, create in hongqing, 世界划分
//2016.07.12, czs, edit in huoda geo lib 510, 可选县区，默认否

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Geo.Utils
{
    /// <summary>
    /// 地球行政区划
    /// </summary>
    public class EarthAdminRegion
    {
        static EarthAdminRegion instance = new EarthAdminRegion();
        public static EarthAdminRegion Instance
        {
            get { return instance; }
        }

        Dictionary<EarthAreas, List<String>> data = new Dictionary<EarthAreas, List<String>>();
        private EarthAdminRegion()
        {
            Init();
        }

        public List<EarthAreas> GetEarthAreas()
        {
            return new List<EarthAreas>(data.Keys);
        }



        public Dictionary<EarthAreas, List<String>> GetData()
        {
            return data;
        }

        private void Init()
        {
            var names = Geo.Utils.EnumUtil.GetNames(typeof(EarthAreas));
            foreach (var item in names)
            {
                EarthAreas EarthArea = Geo.Utils.EnumUtil.Parse<EarthAreas>(item);
                data[EarthArea] = new List<string>();
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(东亚));
            foreach (var item in names)
            {
                data[EarthAreas.东亚].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(东南亚));
            foreach (var item in names)
            {
                data[EarthAreas.东南亚].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南亚));
            foreach (var item in names)
            {
                data[EarthAreas.南亚].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(中亚));
            foreach (var item in names)
            {
                data[EarthAreas.中亚].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(西亚));
            foreach (var item in names)
            {
                data[EarthAreas.西亚].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(北欧));
            foreach (var item in names)
            {
                data[EarthAreas.北欧].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(东欧));
            foreach (var item in names)
            {
                data[EarthAreas.东欧].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(中欧));
            foreach (var item in names)
            {
                data[EarthAreas.中欧].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(西欧));
            foreach (var item in names)
            {
                data[EarthAreas.西欧].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南欧));
            foreach (var item in names)
            {
                data[EarthAreas.南欧].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(东非));
            foreach (var item in names)
            {
                data[EarthAreas.东非].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(中非));
            foreach (var item in names)
            {
                data[EarthAreas.中非].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(西非));
            foreach (var item in names)
            {
                data[EarthAreas.西非].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南非));
            foreach (var item in names)
            {
                data[EarthAreas.南非].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(大洋洲));
            foreach (var item in names)
            {
                data[EarthAreas.大洋洲].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南美洲北部));
            foreach (var item in names)
            {
                data[EarthAreas.南美洲北部].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南美洲中西部));
            foreach (var item in names)
            {
                data[EarthAreas.南美洲中西部].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南美洲南部));
            foreach (var item in names)
            {
                data[EarthAreas.南美洲南部].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(南美洲东部));
            foreach (var item in names)
            {
                data[EarthAreas.南美洲东部].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(北美));
            foreach (var item in names)
            {
                data[EarthAreas.北美].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(中美洲));
            foreach (var item in names)
            {
                data[EarthAreas.中美洲].Add(item);
            }
            names = Geo.Utils.EnumUtil.GetNames(typeof(北美洲加勒比海地区));
            foreach (var item in names)
            {
                data[EarthAreas.北美洲加勒比海地区].Add(item);
            }

        }
    }
    #region contry Enums
    /// <summary>
    /// 地球区划
    /// </summary>
    public enum EarthAreas
    {
        东亚, 东南亚, 南亚, 中亚, 西亚,
        东欧, 南欧, 西欧, 北欧, 中欧,
        东非, 中非, 西非, 南非,
        大洋洲,
        南美洲北部, 南美洲中西部, 南美洲南部, 南美洲东部,
        北美, 中美洲, 北美洲加勒比海地区,
        南极洲
    }
    
    #region 亚洲
    public enum 东亚
    {
        中国, 蒙古, 朝鲜, 韩国, 日本
    }

    public enum 东南亚
    {
        菲律宾, 越南, 老挝, 柬埔寨,
        缅甸, 泰国, 马来西亚, 文莱,
        新加坡, 印度尼西亚, 东帝汶,
    }

    public enum 南亚
    {
        尼泊尔, 不丹, 孟加拉国,
        印度, 巴基斯坦, 斯里兰卡, 马尔代夫,
    }
    public enum 中亚
    {
        哈萨克斯坦, 吉尔吉斯斯坦, 塔吉克斯坦,
        乌兹别克斯坦, 土库曼斯坦
    }

    public enum 西亚
    {
        伊拉克, 伊朗, 叙利亚,
        约旦, 黎巴嫩, 以色列, 巴勒斯坦,
        沙特阿拉伯, 巴林, 卡塔尔, 科威特,
        阿拉伯联合酋长国, 阿曼, 也门, 格鲁吉亚,
        亚美尼亚, 阿塞拜疆, 土耳其, 塞浦路斯,
    }
    #endregion

    #region 欧洲
    public enum 北欧
    {
        芬兰, 瑞典, 挪威,
        冰岛, 丹麦, 法罗群岛
    }

    public enum 东欧
    {
        爱沙尼亚, 拉脱维亚, 立陶宛,
        白俄罗斯, 俄罗斯, 乌克兰,
        摩尔多瓦
    }

    public enum 中欧
    {
        波兰, 捷克, 斯洛伐克,
        匈牙利, 德国, 奥地利, 瑞士, 列支敦士登
    }

    public enum 西欧
    {
        英国, 爱尔兰, 荷兰,
        比利时, 卢森堡, 法国, 摩纳哥
    }

    public enum 南欧
    {
        罗马尼亚, 保加利亚, 塞尔维亚,
        马其顿, 阿尔巴尼亚, 希腊, 斯洛文尼亚,
        克罗地亚, 波斯尼亚和墨塞哥维那, 意大利, 梵蒂冈,
        圣马力诺, 马耳他, 西班牙, 葡萄牙, 安道尔
    }
    #endregion

    #region 非洲
    public enum 东非
    {
        埃塞俄比亚, 厄立特里亚, 索马里,
        吉布提, 肯尼亚, 坦桑尼亚, 乌干达,
        卢旺达, 布隆迪, 塞舌尔
    }

    public enum 中非
    {
        乍得, 中非, 喀麦隆,
        赤道几内亚
            , 加蓬, 刚果共和国, 刚果民主共和国, 圣多美及普林西比
    }

    public enum 西非
    {
        毛里塔尼亚, 西撒哈拉, 塞内加尔,
        冈比亚, 马里, 布基, 纳法索,
        几内亚, 几内亚比绍, 佛得角, 塞拉利昂,
        利比里亚, 科特迪瓦, 加纳, 多哥,
        贝宁, 尼日尔, 加那利群岛
    }

    public enum 南非
    {
        赞比亚, 安哥拉, 津巴布韦,
        马拉维
            , 莫桑比克, 博茨瓦纳, 纳米比亚,
        南非
            , 斯威士兰, 莱索托, 马达加斯加,
        科摩罗
            , 毛里求斯, 留尼旺_法, 圣赫勒拿_英
    }
    #endregion

    public enum 大洋洲
    {
        澳大利亚, 新西兰, 巴布亚新几内亚, 所罗门群岛,
        瓦努阿图, 密克罗尼西亚, 马绍尔群岛, 帕劳,
        瑙鲁, 基里巴斯, 图瓦卢, 萨摩亚,
        斐济群岛, 汤加, 库克群岛_新, 关岛_美,
        新喀里多尼亚_法, 法属波利尼西亚, 皮特凯恩岛_英, 瓦利斯与富图纳_法,
        纽埃_新, 托克劳_新,
        美属萨摩亚, 北马里亚纳_美
    }

    #region 南美洲
    /// <summary>
    /// 12个国家/1个地区
    /// </summary>
    public enum 南美洲北部
    {
        哥伦比亚, 委内瑞拉, 圭亚那,
        法属圭亚那
            , 苏里南
    }

    public enum 南美洲中西部 { 厄瓜多尔, 秘鲁, 玻利维亚 }
    public enum 南美洲南部 { 智利, 阿根廷, 乌拉圭, 巴拉圭 }

    public enum 南美洲东部 { 巴西 }
    #endregion
    #region 北美洲

    //  北美洲_23个国家/13个地区 

    public enum 北美 { 加拿大, 美国, 墨西哥, 格陵兰_丹 }
    public enum 中美洲
    {
        危地马拉, 伯利兹, 萨尔瓦多,
        洪都拉斯, 尼加拉瓜, 哥斯达黎加, 巴拿马
    }
    public enum 北美洲加勒比海地区
    {
        古巴, 牙买加, 海地,
        多米尼加共和国, 安提瓜和巴布达, 圣基茨和尼维斯, 多米尼克,
        圣卢西亚, 圣文森特和格林纳丁斯, 格林纳达, 巴巴多斯,
        特立尼达和多巴哥, 波多黎各_美, 英属维尔京群岛, 美属维尔京群岛, 安圭拉_英, 蒙特塞拉特_英, 瓜德罗普_法, 马提尼克_法,
        荷属安的列斯, 阿鲁巴_荷, 特克斯和凯科斯群岛_英,
        开曼群岛_英, 百慕大_英
    }
    #endregion
    #endregion

    /// <summary>
    /// 中国行政区划
    /// </summary>
    public class ChineseAdminRegion
    {
        static ChineseAdminRegion instance = new ChineseAdminRegion();
        public static ChineseAdminRegion Instance
        {
            get { return instance; }
        } 

        private ChineseAdminRegion()
        {
            IsUsingCounty = false;
            Init();
        }

        /// <summary>
        /// 是否采用区、县
        /// </summary>
        public bool IsUsingCounty { get; set; }
        public List<string> GetProvences()
        {
            return new List<string>(data.Keys);
        }

        public Dictionary<string, List<string>> GetProviceCitiesDic()
        {
            Dictionary<string, List<string>> list = new Dictionary<string, List<string>>();
            foreach (var item in data)
            {
                list[item.Key] = new List<string>(item.Value.Keys);
            }

            return list;
        }


        public Dictionary<string, Dictionary<string, List<String>>> GetData()
        {
            return data;
        }

        private void Init()
        {
            Add("直辖市", "北京市", "东城区");
            Add("直辖市", "北京市", "西城区");
            Add("直辖市", "北京市", "崇文区");
            Add("直辖市", "北京市", "宣武区");
            Add("直辖市", "北京市", "朝阳区");
            Add("直辖市", "北京市", "丰台区");
            Add("直辖市", "北京市", "石景山区");
            Add("直辖市", "北京市", "海淀区");
            Add("直辖市", "北京市", "门头沟区");
            Add("直辖市", "北京市", "房山区");
            Add("直辖市", "北京市", "通州区");
            Add("直辖市", "北京市", "顺义区");
            Add("直辖市", "北京市", "昌平区");
            Add("直辖市", "北京市", "大兴区");
            Add("直辖市", "北京市", "平谷区");
            Add("直辖市", "北京市", "怀柔区");
            Add("直辖市", "北京市", "密云县");
            Add("直辖市", "北京市", "延庆县");
            Add("直辖市", "天津市", "和平区");
            Add("直辖市", "天津市", "河东区");
            Add("直辖市", "天津市", "河西区");
            Add("直辖市", "天津市", "南开区");
            Add("直辖市", "天津市", "河北区");
            Add("直辖市", "天津市", "红桥区");
            Add("直辖市", "天津市", "塘沽区");
            Add("直辖市", "天津市", "汉沽区");
            Add("直辖市", "天津市", "大港区");
            Add("直辖市", "天津市", "东丽区");
            Add("直辖市", "天津市", "西青区");
            Add("直辖市", "天津市", "津南区");
            Add("直辖市", "天津市", "北辰区");
            Add("直辖市", "天津市", "武清区");
            Add("直辖市", "天津市", "宝坻区");
            Add("直辖市", "天津市", "宁河县");
            Add("直辖市", "天津市", "静海县");
            Add("直辖市", "天津市", "蓟县");
            Add("河北省", "石家庄市", "长安区");
            Add("河北省", "石家庄市", "桥东区");
            Add("河北省", "石家庄市", "桥西区");
            Add("河北省", "石家庄市", "新华区");
            Add("河北省", "石家庄市", "郊区");
            Add("河北省", "石家庄市", "井陉矿区");
            Add("河北省", "石家庄市", "井陉县");
            Add("河北省", "石家庄市", "正定县");
            Add("河北省", "石家庄市", "栾城县");
            Add("河北省", "石家庄市", "行唐县");
            Add("河北省", "石家庄市", "灵寿县");
            Add("河北省", "石家庄市", "高邑县");
            Add("河北省", "石家庄市", "深泽县");
            Add("河北省", "石家庄市", "赞皇县");
            Add("河北省", "石家庄市", "无极县");
            Add("河北省", "石家庄市", "平山县");
            Add("河北省", "石家庄市", "元氏县");
            Add("河北省", "石家庄市", "赵县");
            Add("河北省", "石家庄市", "辛集市");
            Add("河北省", "石家庄市", "藁城市");
            Add("河北省", "石家庄市", "晋州市");
            Add("河北省", "石家庄市", "新乐市");
            Add("河北省", "石家庄市", "鹿泉市");
            Add("河北省", "唐山市", "路南区");
            Add("河北省", "唐山市", "路北区");
            Add("河北省", "唐山市", "古冶区");
            Add("河北省", "唐山市", "开平区");
            Add("河北省", "唐山市", "新区");
            Add("河北省", "唐山市", "丰润县");
            Add("河北省", "唐山市", "滦县");
            Add("河北省", "唐山市", "滦南县");
            Add("河北省", "唐山市", "乐亭县");
            Add("河北省", "唐山市", "迁西县");
            Add("河北省", "唐山市", "玉田县");
            Add("河北省", "唐山市", "唐海县");
            Add("河北省", "唐山市", "遵化市");
            Add("河北省", "唐山市", "丰南市");
            Add("河北省", "唐山市", "迁安市");
            Add("河北省", "秦皇岛市", "海港区");
            Add("河北省", "秦皇岛市", "山海关区");
            Add("河北省", "秦皇岛市", "北戴河区");
            Add("河北省", "秦皇岛市", "青龙满族自治县");
            Add("河北省", "秦皇岛市", "昌黎县");
            Add("河北省", "秦皇岛市", "抚宁县");
            Add("河北省", "秦皇岛市", "卢龙县");
            Add("河北省", "邯郸市", "邯山区");
            Add("河北省", "邯郸市", "丛台区");
            Add("河北省", "邯郸市", "复兴区");
            Add("河北省", "邯郸市", "峰峰矿区");
            Add("河北省", "邯郸市", "邯郸县");
            Add("河北省", "邯郸市", "临漳县");
            Add("河北省", "邯郸市", "成安县");
            Add("河北省", "邯郸市", "大名县");
            Add("河北省", "邯郸市", "涉县");
            Add("河北省", "邯郸市", "磁县");
            Add("河北省", "邯郸市", "肥乡县");
            Add("河北省", "邯郸市", "永年县");
            Add("河北省", "邯郸市", "邱县");
            Add("河北省", "邯郸市", "鸡泽县");
            Add("河北省", "邯郸市", "广平县");
            Add("河北省", "邯郸市", "馆陶县");
            Add("河北省", "邯郸市", "魏县");
            Add("河北省", "邯郸市", "曲周县");
            Add("河北省", "邯郸市", "武安市");
            Add("河北省", "邢台市", "桥东区");
            Add("河北省", "邢台市", "桥西区");
            Add("河北省", "邢台市", "邢台县");
            Add("河北省", "邢台市", "临城县");
            Add("河北省", "邢台市", "内丘县");
            Add("河北省", "邢台市", "柏乡县");
            Add("河北省", "邢台市", "隆尧县");
            Add("河北省", "邢台市", "任县");
            Add("河北省", "邢台市", "南和县");
            Add("河北省", "邢台市", "宁晋县");
            Add("河北省", "邢台市", "巨鹿县");
            Add("河北省", "邢台市", "新河县");
            Add("河北省", "邢台市", "广宗县");
            Add("河北省", "邢台市", "平乡县");
            Add("河北省", "邢台市", "威县");
            Add("河北省", "邢台市", "清河县");
            Add("河北省", "邢台市", "临西县");
            Add("河北省", "邢台市", "南宫市");
            Add("河北省", "邢台市", "沙河市");
            Add("河北省", "保定市", "新市区");
            Add("河北省", "保定市", "北市区");
            Add("河北省", "保定市", "南市区");
            Add("河北省", "保定市", "满城县");
            Add("河北省", "保定市", "清苑县");
            Add("河北省", "保定市", "涞水县");
            Add("河北省", "保定市", "阜平县");
            Add("河北省", "保定市", "徐水县");
            Add("河北省", "保定市", "定兴县");
            Add("河北省", "保定市", "唐县");
            Add("河北省", "保定市", "高阳县");
            Add("河北省", "保定市", "容城县");
            Add("河北省", "保定市", "涞源县");
            Add("河北省", "保定市", "望都县");
            Add("河北省", "保定市", "安新县");
            Add("河北省", "保定市", "易县");
            Add("河北省", "保定市", "曲阳县");
            Add("河北省", "保定市", "蠡县");
            Add("河北省", "保定市", "顺平县");
            Add("河北省", "保定市", "博野县");
            Add("河北省", "保定市", "雄县");
            Add("河北省", "保定市", "涿州市");
            Add("河北省", "保定市", "定州市");
            Add("河北省", "保定市", "安国市");
            Add("河北省", "保定市", "高碑店市");
            Add("河北省", "张家口市", "桥东区");
            Add("河北省", "张家口市", "桥西区");
            Add("河北省", "张家口市", "宣化区");
            Add("河北省", "张家口市", "下花园区");
            Add("河北省", "张家口市", "宣化县");
            Add("河北省", "张家口市", "张北县");
            Add("河北省", "张家口市", "康保县");
            Add("河北省", "张家口市", "沽源县");
            Add("河北省", "张家口市", "尚义县");
            Add("河北省", "张家口市", "蔚县");
            Add("河北省", "张家口市", "阳原县");
            Add("河北省", "张家口市", "怀安县");
            Add("河北省", "张家口市", "万全县");
            Add("河北省", "张家口市", "怀来县");
            Add("河北省", "张家口市", "涿鹿县");
            Add("河北省", "张家口市", "赤城县");
            Add("河北省", "张家口市", "崇礼县");
            Add("河北省", "承德市", "双桥区");
            Add("河北省", "承德市", "双滦区");
            Add("河北省", "承德市", "鹰手营子矿区");
            Add("河北省", "承德市", "承德县");
            Add("河北省", "承德市", "兴隆县");
            Add("河北省", "承德市", "平泉县");
            Add("河北省", "承德市", "滦平县");
            Add("河北省", "承德市", "隆化县");
            Add("河北省", "承德市", "丰宁满族自治县");
            Add("河北省", "承德市", "宽城满族自治县");
            Add("河北省", "承德市", "围场满族蒙古族自治县");
            Add("河北省", "沧州市", "新华区");
            Add("河北省", "沧州市", "运河区");
            Add("河北省", "沧州市", "沧县");
            Add("河北省", "沧州市", "青县");
            Add("河北省", "沧州市", "东光县");
            Add("河北省", "沧州市", "海兴县");
            Add("河北省", "沧州市", "盐山县");
            Add("河北省", "沧州市", "肃宁县");
            Add("河北省", "沧州市", "南皮县");
            Add("河北省", "沧州市", "吴桥县");
            Add("河北省", "沧州市", "献县");
            Add("河北省", "沧州市", "孟村回族自治县");
            Add("河北省", "沧州市", "泊头市");
            Add("河北省", "沧州市", "任丘市");
            Add("河北省", "沧州市", "黄骅市");
            Add("河北省", "沧州市", "河间市");
            Add("河北省", "廊坊市", "安次区");
            Add("河北省", "廊坊市", "固安县");
            Add("河北省", "廊坊市", "永清县");
            Add("河北省", "廊坊市", "香河县");
            Add("河北省", "廊坊市", "大城县");
            Add("河北省", "廊坊市", "文安县");
            Add("河北省", "廊坊市", "大厂回族自治县");
            Add("河北省", "廊坊市", "霸州市");
            Add("河北省", "廊坊市", "三河市");
            Add("河北省", "衡水市", "桃城区");
            Add("河北省", "衡水市", "枣强县");
            Add("河北省", "衡水市", "武邑县");
            Add("河北省", "衡水市", "武强县");
            Add("河北省", "衡水市", "饶阳县");
            Add("河北省", "衡水市", "安平县");
            Add("河北省", "衡水市", "故城县");
            Add("河北省", "衡水市", "景县");
            Add("河北省", "衡水市", "阜城县");
            Add("河北省", "衡水市", "冀州市");
            Add("河北省", "衡水市", "深州市");
            Add("山西省", "太原市", "小店区");
            Add("山西省", "太原市", "迎泽区");
            Add("山西省", "太原市", "杏花岭区");
            Add("山西省", "太原市", "尖草坪区");
            Add("山西省", "太原市", "万柏林区");
            Add("山西省", "太原市", "晋源区");
            Add("山西省", "太原市", "清徐县");
            Add("山西省", "太原市", "阳曲县");
            Add("山西省", "太原市", "娄烦县");
            Add("山西省", "太原市", "古交市");
            Add("山西省", "大同市", "城区");
            Add("山西省", "大同市", "矿区");
            Add("山西省", "大同市", "南郊区");
            Add("山西省", "大同市", "新荣区");
            Add("山西省", "大同市", "阳高县");
            Add("山西省", "大同市", "天镇县");
            Add("山西省", "大同市", "广灵县");
            Add("山西省", "大同市", "灵丘县");
            Add("山西省", "大同市", "浑源县");
            Add("山西省", "大同市", "左云县");
            Add("山西省", "大同市", "大同县");
            Add("山西省", "阳泉市", "城区");
            Add("山西省", "阳泉市", "矿区");
            Add("山西省", "阳泉市", "郊区");
            Add("山西省", "阳泉市", "平定县");
            Add("山西省", "阳泉市", "盂县");
            Add("山西省", "长治市", "城区");
            Add("山西省", "长治市", "郊区");
            Add("山西省", "长治市", "长治县");
            Add("山西省", "长治市", "襄垣县");
            Add("山西省", "长治市", "屯留县");
            Add("山西省", "长治市", "平顺县");
            Add("山西省", "长治市", "黎城县");
            Add("山西省", "长治市", "壶关县");
            Add("山西省", "长治市", "长子县");
            Add("山西省", "长治市", "武乡县");
            Add("山西省", "长治市", "沁县");
            Add("山西省", "长治市", "沁源县");
            Add("山西省", "长治市", "潞城市");
            Add("山西省", "晋城市", "城区");
            Add("山西省", "晋城市", "沁水县");
            Add("山西省", "晋城市", "阳城县");
            Add("山西省", "晋城市", "陵川县");
            Add("山西省", "晋城市", "泽州县");
            Add("山西省", "晋城市", "高平市");
            Add("山西省", "朔州市", "朔城区");
            Add("山西省", "朔州市", "平鲁区");
            Add("山西省", "朔州市", "山阴县");
            Add("山西省", "朔州市", "应县");
            Add("山西省", "朔州市", "右玉县");
            Add("山西省", "朔州市", "怀仁县");
            Add("山西省", "忻州市", "忻府区");
            Add("山西省", "忻州市", "原平市");
            Add("山西省", "忻州市", "定襄县");
            Add("山西省", "忻州市", "五台县");
            Add("山西省", "忻州市", "代县");
            Add("山西省", "忻州市", "繁峙县");
            Add("山西省", "忻州市", "宁武县");
            Add("山西省", "忻州市", "静乐县");
            Add("山西省", "忻州市", "神池县");
            Add("山西省", "忻州市", "五寨县");
            Add("山西省", "忻州市", "岢岚县");
            Add("山西省", "忻州市", "河曲县");
            Add("山西省", "忻州市", "保德县");
            Add("山西省", "忻州市", "偏关县");
            Add("山西省", "吕梁市", "离石区");
            Add("山西省", "吕梁市", "孝义市");
            Add("山西省", "吕梁市", "汾阳市");
            Add("山西省", "吕梁市", "文水县");
            Add("山西省", "吕梁市", "交城县");
            Add("山西省", "吕梁市", "兴县");
            Add("山西省", "吕梁市", "临县");
            Add("山西省", "吕梁市", "柳林县");
            Add("山西省", "吕梁市", "石楼县");
            Add("山西省", "吕梁市", "岚县");
            Add("山西省", "吕梁市", "方山县");
            Add("山西省", "吕梁市", "中阳县");
            Add("山西省", "吕梁市", "交口县");
            Add("山西省", "晋中市", "榆次市");
            Add("山西省", "晋中市", "介休市");
            Add("山西省", "晋中市", "榆社县");
            Add("山西省", "晋中市", "左权县");
            Add("山西省", "晋中市", "和顺县");
            Add("山西省", "晋中市", "昔阳县");
            Add("山西省", "晋中市", "寿阳县");
            Add("山西省", "晋中市", "太谷县");
            Add("山西省", "晋中市", "祁县");
            Add("山西省", "晋中市", "平遥县");
            Add("山西省", "晋中市", "灵石县");
            Add("山西省", "临汾市", "临汾市");
            Add("山西省", "临汾市", "侯马市");
            Add("山西省", "临汾市", "霍州市");
            Add("山西省", "临汾市", "曲沃县");
            Add("山西省", "临汾市", "翼城县");
            Add("山西省", "临汾市", "襄汾县");
            Add("山西省", "临汾市", "洪洞县");
            Add("山西省", "临汾市", "古县");
            Add("山西省", "临汾市", "安泽县");
            Add("山西省", "临汾市", "浮山县");
            Add("山西省", "临汾市", "吉县");
            Add("山西省", "临汾市", "乡宁县");
            Add("山西省", "临汾市", "蒲县");
            Add("山西省", "临汾市", "大宁县");
            Add("山西省", "临汾市", "永和县");
            Add("山西省", "临汾市", "隰县");
            Add("山西省", "临汾市", "汾西县");
            Add("山西省", "运城市", "运城市");
            Add("山西省", "运城市", "永济市");
            Add("山西省", "运城市", "河津市");
            Add("山西省", "运城市", "芮城县");
            Add("山西省", "运城市", "临猗县");
            Add("山西省", "运城市", "万荣县");
            Add("山西省", "运城市", "新绛县");
            Add("山西省", "运城市", "稷山县");
            Add("山西省", "运城市", "闻喜县");
            Add("山西省", "运城市", "夏县");
            Add("山西省", "运城市", "绛县");
            Add("山西省", "运城市", "平陆县");
            Add("山西省", "运城市", "垣曲县");
            Add("内蒙古", "呼和浩特市", "新城区");
            Add("内蒙古", "呼和浩特市", "回民区");
            Add("内蒙古", "呼和浩特市", "玉泉区");
            Add("内蒙古", "呼和浩特市", "郊区");
            Add("内蒙古", "呼和浩特市", "土默特左旗");
            Add("内蒙古", "呼和浩特市", "托克托县");
            Add("内蒙古", "呼和浩特市", "和林格尔县");
            Add("内蒙古", "呼和浩特市", "清水河县");
            Add("内蒙古", "呼和浩特市", "武川县");
            Add("内蒙古", "包头市", "东河区");
            Add("内蒙古", "包头市", "昆都伦区");
            Add("内蒙古", "包头市", "青山区");
            Add("内蒙古", "包头市", "石拐矿区");
            Add("内蒙古", "包头市", "白云矿区");
            Add("内蒙古", "包头市", "郊区");
            Add("内蒙古", "包头市", "土默特右旗");
            Add("内蒙古", "包头市", "固阳县");
            Add("内蒙古", "包头市", "达尔罕茂明安联合旗");
            Add("内蒙古", "乌海市", "海勃湾区");
            Add("内蒙古", "乌海市", "海南区");
            Add("内蒙古", "乌海市", "乌达区");
            Add("内蒙古", "赤峰市", "红山区");
            Add("内蒙古", "赤峰市", "元宝山区");
            Add("内蒙古", "赤峰市", "松山区");
            Add("内蒙古", "赤峰市", "阿鲁科尔沁旗");
            Add("内蒙古", "赤峰市", "巴林左旗");
            Add("内蒙古", "赤峰市", "巴林右旗");
            Add("内蒙古", "赤峰市", "林西县");
            Add("内蒙古", "赤峰市", "克什克腾旗");
            Add("内蒙古", "赤峰市", "翁牛特旗");
            Add("内蒙古", "赤峰市", "喀喇沁旗");
            Add("内蒙古", "赤峰市", "宁城县");
            Add("内蒙古", "赤峰市", "敖汉旗");
            Add("内蒙古", "呼伦贝尔市", "海拉尔市");
            Add("内蒙古", "呼伦贝尔市", "满洲里市");
            Add("内蒙古", "呼伦贝尔市", "扎兰屯市");
            Add("内蒙古", "呼伦贝尔市", "牙克石市");
            Add("内蒙古", "呼伦贝尔市", "根河市");
            Add("内蒙古", "呼伦贝尔市", "额尔古纳市");
            Add("内蒙古", "呼伦贝尔市", "阿荣旗");
            Add("内蒙古", "呼伦贝尔市", "莫力达瓦达斡尔族自治旗");
            Add("内蒙古", "呼伦贝尔市", "鄂伦春自治旗");
            Add("内蒙古", "呼伦贝尔市", "鄂温克族自治旗");
            Add("内蒙古", "呼伦贝尔市", "新巴尔虎右旗");
            Add("内蒙古", "呼伦贝尔市", "新巴尔虎左旗");
            Add("内蒙古", "呼伦贝尔市", "陈巴尔虎旗");
            Add("内蒙古", "兴安盟", "乌兰浩特市");
            Add("内蒙古", "兴安盟", "阿尔山市");
            Add("内蒙古", "兴安盟", "科尔沁右翼前旗");
            Add("内蒙古", "兴安盟", "科尔沁右翼中旗");
            Add("内蒙古", "兴安盟", "扎赉特旗");
            Add("内蒙古", "兴安盟", "突泉县");
            Add("内蒙古", "通辽市", "科尔沁区");
            Add("内蒙古", "通辽市", "霍林郭勒市");
            Add("内蒙古", "通辽市", "科尔沁左翼中旗");
            Add("内蒙古", "通辽市", "科尔沁左翼后旗");
            Add("内蒙古", "通辽市", "开鲁县");
            Add("内蒙古", "通辽市", "库伦旗");
            Add("内蒙古", "通辽市", "奈曼旗");
            Add("内蒙古", "通辽市", "扎鲁特旗");
            Add("内蒙古", "锡林郭勒盟", "二连浩特市");
            Add("内蒙古", "锡林郭勒盟", "锡林浩特市");
            Add("内蒙古", "锡林郭勒盟", "阿巴嘎旗");
            Add("内蒙古", "锡林郭勒盟", "苏尼特左旗");
            Add("内蒙古", "锡林郭勒盟", "苏尼特右旗");
            Add("内蒙古", "锡林郭勒盟", "东乌珠穆沁旗");
            Add("内蒙古", "锡林郭勒盟", "西乌珠穆沁旗");
            Add("内蒙古", "锡林郭勒盟", "太仆寺旗");
            Add("内蒙古", "锡林郭勒盟", "镶黄旗");
            Add("内蒙古", "锡林郭勒盟", "正镶白旗");
            Add("内蒙古", "锡林郭勒盟", "正蓝旗");
            Add("内蒙古", "锡林郭勒盟", "多伦县");
            Add("内蒙古", "乌兰察布盟", "集宁市");
            Add("内蒙古", "乌兰察布盟", "丰镇市");
            Add("内蒙古", "乌兰察布盟", "卓资县");
            Add("内蒙古", "乌兰察布盟", "化德县");
            Add("内蒙古", "乌兰察布盟", "商都县");
            Add("内蒙古", "乌兰察布盟", "兴和县");
            Add("内蒙古", "乌兰察布盟", "凉城县");
            Add("内蒙古", "乌兰察布盟", "察哈尔右翼前旗");
            Add("内蒙古", "乌兰察布盟", "察哈尔右翼中旗");
            Add("内蒙古", "乌兰察布盟", "察哈尔右翼后旗");
            Add("内蒙古", "乌兰察布盟", "四子王旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "东胜市");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "达拉特旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "准格尔旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "鄂托克前旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "鄂托克旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "杭锦旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "乌审旗");
            Add("内蒙古", "伊克昭盟_鄂尔多斯旧称", "伊金霍洛旗");
            Add("内蒙古", "巴彦淖尔盟", "临河市");
            Add("内蒙古", "巴彦淖尔盟", "五原县");
            Add("内蒙古", "巴彦淖尔盟", "磴口县");
            Add("内蒙古", "巴彦淖尔盟", "乌拉特前旗");
            Add("内蒙古", "巴彦淖尔盟", "乌拉特中旗");
            Add("内蒙古", "巴彦淖尔盟", "乌拉特后旗");
            Add("内蒙古", "巴彦淖尔盟", "杭锦后旗");
            Add("内蒙古", "阿拉善盟", "阿拉善左旗");
            Add("内蒙古", "阿拉善盟", "阿拉善右旗");
            Add("内蒙古", "阿拉善盟", "额济纳旗");
            Add("辽宁省", "沈阳市", "和平区");
            Add("辽宁省", "沈阳市", "沈河区");
            Add("辽宁省", "沈阳市", "大东区");
            Add("辽宁省", "沈阳市", "皇姑区");
            Add("辽宁省", "沈阳市", "铁西区");
            Add("辽宁省", "沈阳市", "苏家屯区");
            Add("辽宁省", "沈阳市", "东陵区");
            Add("辽宁省", "沈阳市", "新城子区");
            Add("辽宁省", "沈阳市", "于洪区");
            Add("辽宁省", "沈阳市", "辽中县");
            Add("辽宁省", "沈阳市", "康平县");
            Add("辽宁省", "沈阳市", "法库县");
            Add("辽宁省", "沈阳市", "新民市");
            Add("辽宁省", "大连市", "中山区");
            Add("辽宁省", "大连市", "西岗区");
            Add("辽宁省", "大连市", "沙河口区");
            Add("辽宁省", "大连市", "甘井子区");
            Add("辽宁省", "大连市", "旅顺口区");
            Add("辽宁省", "大连市", "金州区");
            Add("辽宁省", "大连市", "长海县");
            Add("辽宁省", "大连市", "瓦房店市");
            Add("辽宁省", "大连市", "普兰店市");
            Add("辽宁省", "大连市", "庄河市");
            Add("辽宁省", "鞍山市", "铁东区");
            Add("辽宁省", "鞍山市", "铁西区");
            Add("辽宁省", "鞍山市", "立山区");
            Add("辽宁省", "鞍山市", "千山区");
            Add("辽宁省", "鞍山市", "台安县");
            Add("辽宁省", "鞍山市", "岫岩满族自治县");
            Add("辽宁省", "鞍山市", "海城市");
            Add("辽宁省", "抚顺市", "新抚区");
            Add("辽宁省", "抚顺市", "露天区");
            Add("辽宁省", "抚顺市", "望花区");
            Add("辽宁省", "抚顺市", "顺城区");
            Add("辽宁省", "抚顺市", "抚顺县");
            Add("辽宁省", "抚顺市", "新宾满族自治县");
            Add("辽宁省", "抚顺市", "清原满族自治县");
            Add("辽宁省", "本溪市", "平山区");
            Add("辽宁省", "本溪市", "溪湖区");
            Add("辽宁省", "本溪市", "明山区");
            Add("辽宁省", "本溪市", "南芬区");
            Add("辽宁省", "本溪市", "本溪满族自治县");
            Add("辽宁省", "本溪市", "桓仁满族自治县");
            Add("辽宁省", "丹东市", "元宝区");
            Add("辽宁省", "丹东市", "振兴区");
            Add("辽宁省", "丹东市", "振安区");
            Add("辽宁省", "丹东市", "宽甸满族自治县");
            Add("辽宁省", "丹东市", "东港市");
            Add("辽宁省", "丹东市", "凤城市");
            Add("辽宁省", "锦州市", "古塔区");
            Add("辽宁省", "锦州市", "凌河区");
            Add("辽宁省", "锦州市", "太和区");
            Add("辽宁省", "锦州市", "黑山县");
            Add("辽宁省", "锦州市", "义县");
            Add("辽宁省", "锦州市", "凌海市");
            Add("辽宁省", "锦州市", "北宁市");
            Add("辽宁省", "营口市", "站前区");
            Add("辽宁省", "营口市", "西市区");
            Add("辽宁省", "营口市", "鲅鱼圈区");
            Add("辽宁省", "营口市", "老边区");
            Add("辽宁省", "营口市", "盖州市");
            Add("辽宁省", "营口市", "大石桥市");
            Add("辽宁省", "阜新市", "海州区");
            Add("辽宁省", "阜新市", "新邱区");
            Add("辽宁省", "阜新市", "太平区");
            Add("辽宁省", "阜新市", "清河门区");
            Add("辽宁省", "阜新市", "细河区");
            Add("辽宁省", "阜新市", "阜新蒙古族自治县");
            Add("辽宁省", "阜新市", "彰武县");
            Add("辽宁省", "辽阳市", "白塔区");
            Add("辽宁省", "辽阳市", "文圣区");
            Add("辽宁省", "辽阳市", "宏伟区");
            Add("辽宁省", "辽阳市", "弓长岭区");
            Add("辽宁省", "辽阳市", "太子河区");
            Add("辽宁省", "辽阳市", "辽阳县");
            Add("辽宁省", "辽阳市", "灯塔市");
            Add("辽宁省", "盘锦市", "双台子区");
            Add("辽宁省", "盘锦市", "兴隆台区");
            Add("辽宁省", "盘锦市", "大洼县");
            Add("辽宁省", "盘锦市", "盘山县");
            Add("辽宁省", "铁岭市", "银州区");
            Add("辽宁省", "铁岭市", "清河区");
            Add("辽宁省", "铁岭市", "铁岭县");
            Add("辽宁省", "铁岭市", "西丰县");
            Add("辽宁省", "铁岭市", "昌图县");
            Add("辽宁省", "铁岭市", "铁法市");
            Add("辽宁省", "铁岭市", "开原市");
            Add("辽宁省", "朝阳市", "双塔区");
            Add("辽宁省", "朝阳市", "龙城区");
            Add("辽宁省", "朝阳市", "朝阳县");
            Add("辽宁省", "朝阳市", "建平县");
            Add("辽宁省", "朝阳市", "喀喇沁左翼蒙古族自治县");
            Add("辽宁省", "朝阳市", "北票市");
            Add("辽宁省", "朝阳市", "凌源市");
            Add("辽宁省", "葫芦岛市", "连山区");
            Add("辽宁省", "葫芦岛市", "龙港区");
            Add("辽宁省", "葫芦岛市", "南票区");
            Add("辽宁省", "葫芦岛市", "绥中县");
            Add("辽宁省", "葫芦岛市", "建昌县");
            Add("辽宁省", "葫芦岛市", "兴城市");
            Add("吉林省", "长春市", "南关区");
            Add("吉林省", "长春市", "宽城区");
            Add("吉林省", "长春市", "朝阳区");
            Add("吉林省", "长春市", "二道区");
            Add("吉林省", "长春市", "绿园区");
            Add("吉林省", "长春市", "双阳区");
            Add("吉林省", "长春市", "农安县");
            Add("吉林省", "长春市", "九台市");
            Add("吉林省", "长春市", "榆树市");
            Add("吉林省", "长春市", "德惠市");
            Add("吉林省", "吉林市", "昌邑区");
            Add("吉林省", "吉林市", "龙潭区");
            Add("吉林省", "吉林市", "船营区");
            Add("吉林省", "吉林市", "丰满区");
            Add("吉林省", "吉林市", "永吉县");
            Add("吉林省", "吉林市", "蛟河市");
            Add("吉林省", "吉林市", "桦甸市");
            Add("吉林省", "吉林市", "舒兰市");
            Add("吉林省", "吉林市", "磐石市");
            Add("吉林省", "四平市", "铁西区");
            Add("吉林省", "四平市", "铁东区");
            Add("吉林省", "四平市", "梨树县");
            Add("吉林省", "四平市", "伊通满族自治县");
            Add("吉林省", "四平市", "公主岭市");
            Add("吉林省", "四平市", "双辽市");
            Add("吉林省", "辽源市", "龙山区");
            Add("吉林省", "辽源市", "西安区");
            Add("吉林省", "辽源市", "东丰县");
            Add("吉林省", "辽源市", "东辽县");
            Add("吉林省", "通化市", "东昌区");
            Add("吉林省", "通化市", "二道江区");
            Add("吉林省", "通化市", "通化县");
            Add("吉林省", "通化市", "辉南县");
            Add("吉林省", "通化市", "柳河县");
            Add("吉林省", "通化市", "梅河口市");
            Add("吉林省", "通化市", "集安市");
            Add("吉林省", "白山市", "八道江区");
            Add("吉林省", "白山市", "抚松县");
            Add("吉林省", "白山市", "靖宇县");
            Add("吉林省", "白山市", "长白朝鲜族自治县");
            Add("吉林省", "白山市", "江源县");
            Add("吉林省", "白山市", "临江市");
            Add("吉林省", "松原市", "宁江区");
            Add("吉林省", "松原市", "前郭尔罗斯蒙古族自治县");
            Add("吉林省", "松原市", "长岭县");
            Add("吉林省", "松原市", "乾安县");
            Add("吉林省", "松原市", "扶余县");
            Add("吉林省", "白城市", "洮北区");
            Add("吉林省", "白城市", "镇赉县");
            Add("吉林省", "白城市", "通榆县");
            Add("吉林省", "白城市", "洮南市");
            Add("吉林省", "白城市", "大安市");
            Add("吉林省", "延边朝鲜族自治州", "延吉市");
            Add("吉林省", "延边朝鲜族自治州", "图们市");
            Add("吉林省", "延边朝鲜族自治州", "敦化市");
            Add("吉林省", "延边朝鲜族自治州", "珲春市");
            Add("吉林省", "延边朝鲜族自治州", "龙井市");
            Add("吉林省", "延边朝鲜族自治州", "和龙市");
            Add("吉林省", "延边朝鲜族自治州", "汪清县");
            Add("吉林省", "延边朝鲜族自治州", "安图县");
            Add("黑龙江省", "哈尔滨市", "道里区");
            Add("黑龙江省", "哈尔滨市", "南岗区");
            Add("黑龙江省", "哈尔滨市", "道外区");
            Add("黑龙江省", "哈尔滨市", "松北区");
            Add("黑龙江省", "哈尔滨市", "香坊区");
            Add("黑龙江省", "哈尔滨市", "阿成区");
            Add("黑龙江省", "哈尔滨市", "平房区");
            Add("黑龙江省", "哈尔滨市", "呼兰区");
            Add("黑龙江省", "哈尔滨市", "依兰县");
            Add("黑龙江省", "哈尔滨市", "方正县");
            Add("黑龙江省", "哈尔滨市", "宾县");
            Add("黑龙江省", "哈尔滨市", "巴彦县");
            Add("黑龙江省", "哈尔滨市", "木兰县");
            Add("黑龙江省", "哈尔滨市", "通河县");
            Add("黑龙江省", "哈尔滨市", "延寿县");
            Add("黑龙江省", "哈尔滨市", "双城市");
            Add("黑龙江省", "哈尔滨市", "尚志市");
            Add("黑龙江省", "哈尔滨市", "五常市");
            Add("黑龙江省", "齐齐哈尔市", "龙沙区");
            Add("黑龙江省", "齐齐哈尔市", "建华区");
            Add("黑龙江省", "齐齐哈尔市", "铁锋区");
            Add("黑龙江省", "齐齐哈尔市", "昂昂溪区");
            Add("黑龙江省", "齐齐哈尔市", "富拉尔基区");
            Add("黑龙江省", "齐齐哈尔市", "碾子山区");
            Add("黑龙江省", "齐齐哈尔市", "梅里斯达斡尔族区");
            Add("黑龙江省", "齐齐哈尔市", "龙江县");
            Add("黑龙江省", "齐齐哈尔市", "依安县");
            Add("黑龙江省", "齐齐哈尔市", "泰来县");
            Add("黑龙江省", "齐齐哈尔市", "甘南县");
            Add("黑龙江省", "齐齐哈尔市", "富裕县");
            Add("黑龙江省", "齐齐哈尔市", "克山县");
            Add("黑龙江省", "齐齐哈尔市", "克东县");
            Add("黑龙江省", "齐齐哈尔市", "拜泉县");
            Add("黑龙江省", "齐齐哈尔市", "讷河市");
            Add("黑龙江省", "鸡西市", "鸡冠区");
            Add("黑龙江省", "鸡西市", "恒山区");
            Add("黑龙江省", "鸡西市", "滴道区");
            Add("黑龙江省", "鸡西市", "梨树区");
            Add("黑龙江省", "鸡西市", "城子河区");
            Add("黑龙江省", "鸡西市", "麻山区");
            Add("黑龙江省", "鸡西市", "鸡东县");
            Add("黑龙江省", "鸡西市", "虎林市");
            Add("黑龙江省", "鸡西市", "密山市");
            Add("黑龙江省", "鹤岗市", "向阳区");
            Add("黑龙江省", "鹤岗市", "工农区");
            Add("黑龙江省", "鹤岗市", "南山区");
            Add("黑龙江省", "鹤岗市", "兴安区");
            Add("黑龙江省", "鹤岗市", "东山区");
            Add("黑龙江省", "鹤岗市", "兴山区");
            Add("黑龙江省", "鹤岗市", "萝北县");
            Add("黑龙江省", "鹤岗市", "绥滨县");
            Add("黑龙江省", "双鸭山市", "尖山区");
            Add("黑龙江省", "双鸭山市", "岭东区");
            Add("黑龙江省", "双鸭山市", "四方台区");
            Add("黑龙江省", "双鸭山市", "宝山区");
            Add("黑龙江省", "双鸭山市", "集贤县");
            Add("黑龙江省", "双鸭山市", "友谊县");
            Add("黑龙江省", "双鸭山市", "宝清县");
            Add("黑龙江省", "双鸭山市", "饶河县");
            Add("黑龙江省", "大庆市", "萨尔图区");
            Add("黑龙江省", "大庆市", "龙凤区");
            Add("黑龙江省", "大庆市", "让胡路区");
            Add("黑龙江省", "大庆市", "红岗区");
            Add("黑龙江省", "大庆市", "大同区");
            Add("黑龙江省", "大庆市", "肇州县");
            Add("黑龙江省", "大庆市", "肇源县");
            Add("黑龙江省", "大庆市", "林甸县");
            Add("黑龙江省", "大庆市", "杜尔伯特蒙古族自治县");
            Add("黑龙江省", "伊春市", "伊春区");
            Add("黑龙江省", "伊春市", "南岔区");
            Add("黑龙江省", "伊春市", "友好区");
            Add("黑龙江省", "伊春市", "西林区");
            Add("黑龙江省", "伊春市", "翠峦区");
            Add("黑龙江省", "伊春市", "新青区");
            Add("黑龙江省", "伊春市", "美溪区");
            Add("黑龙江省", "伊春市", "金山屯区");
            Add("黑龙江省", "伊春市", "五营区");
            Add("黑龙江省", "伊春市", "乌马河区");
            Add("黑龙江省", "伊春市", "汤旺河区");
            Add("黑龙江省", "伊春市", "带岭区");
            Add("黑龙江省", "伊春市", "乌伊岭区");
            Add("黑龙江省", "伊春市", "红星区");
            Add("黑龙江省", "伊春市", "上甘岭区");
            Add("黑龙江省", "伊春市", "嘉荫县");
            Add("黑龙江省", "伊春市", "铁力市");
            Add("黑龙江省", "伊春市", "向阳区");
            Add("黑龙江省", "伊春市", "前进区");
            Add("黑龙江省", "伊春市", "东风区");
            Add("黑龙江省", "伊春市", "郊区");
            Add("黑龙江省", "伊春市", "桦南县");
            Add("黑龙江省", "伊春市", "桦川县");
            Add("黑龙江省", "伊春市", "汤原县");
            Add("黑龙江省", "伊春市", "抚远县");
            Add("黑龙江省", "伊春市", "同江市");
            Add("黑龙江省", "伊春市", "富锦市");
            Add("黑龙江省", "七台河市", "新兴区");
            Add("黑龙江省", "七台河市", "桃山区");
            Add("黑龙江省", "七台河市", "茄子河区");
            Add("黑龙江省", "七台河市", "勃利县");
            Add("黑龙江省", "牡丹江市", "东安区");
            Add("黑龙江省", "牡丹江市", "阳明区");
            Add("黑龙江省", "牡丹江市", "爱民区");
            Add("黑龙江省", "牡丹江市", "西安区");
            Add("黑龙江省", "牡丹江市", "东宁县");
            Add("黑龙江省", "牡丹江市", "林口县");
            Add("黑龙江省", "牡丹江市", "绥芬河市");
            Add("黑龙江省", "牡丹江市", "海林市");
            Add("黑龙江省", "牡丹江市", "宁安市");
            Add("黑龙江省", "牡丹江市", "穆棱市");
            Add("黑龙江省", "黑河市", "爱辉区");
            Add("黑龙江省", "黑河市", "嫩江县");
            Add("黑龙江省", "黑河市", "逊克县");
            Add("黑龙江省", "黑河市", "孙吴县");
            Add("黑龙江省", "黑河市", "北安市");
            Add("黑龙江省", "黑河市", "五大连池市");
            Add("黑龙江省", "绥化市", "绥化市");
            Add("黑龙江省", "绥化市", "安达市");
            Add("黑龙江省", "绥化市", "肇东市");
            Add("黑龙江省", "绥化市", "海伦市");
            Add("黑龙江省", "绥化市", "望奎县");
            Add("黑龙江省", "绥化市", "兰西县");
            Add("黑龙江省", "绥化市", "青冈县");
            Add("黑龙江省", "绥化市", "庆安县");
            Add("黑龙江省", "绥化市", "明水县");
            Add("黑龙江省", "绥化市", "绥棱县");
            Add("黑龙江省", "大兴安岭地区", "呼玛县");
            Add("黑龙江省", "大兴安岭地区", "塔河县");
            Add("黑龙江省", "大兴安岭地区", "漠河县");
            Add("直辖市", "上海市", "浦东新区");
            Add("直辖市", "上海市", "徐汇区");
            Add("直辖市", "上海市", "黄浦区");
            Add("直辖市", "上海市", "杨浦区");
            Add("直辖市", "上海市", "虹口区");
            Add("直辖市", "上海市", "闵行区");
            Add("直辖市", "上海市", "长宁区");
            Add("直辖市", "上海市", "普陀区");
            Add("直辖市", "上海市", "宝山区");
            Add("直辖市", "上海市", "静安区");
            Add("直辖市", "上海市", "闸北区");
            Add("直辖市", "上海市", "卢湾区");
            Add("直辖市", "上海市", "松江区");
            Add("直辖市", "上海市", "嘉定区");
            Add("直辖市", "上海市", "南汇区");
            Add("直辖市", "上海市", "金山区");
            Add("直辖市", "上海市", "青浦区");
            Add("直辖市", "上海市", "奉贤区");
            Add("直辖市", "上海市", "崇明县");
            Add("江苏省", "南京市", "玄武区");
            Add("江苏省", "南京市", "白下区");
            Add("江苏省", "南京市", "秦淮区");
            Add("江苏省", "南京市", "建邺区");
            Add("江苏省", "南京市", "鼓楼区");
            Add("江苏省", "南京市", "下关区");
            Add("江苏省", "南京市", "浦口区");
            Add("江苏省", "南京市", "栖霞区");
            Add("江苏省", "南京市", "雨花台区");
            Add("江苏省", "南京市", "江宁区");
            Add("江苏省", "南京市", "六合区");
            Add("江苏省", "南京市", "溧水县");
            Add("江苏省", "南京市", "高淳县");
            Add("江苏省", "无锡市", "崇安区");
            Add("江苏省", "无锡市", "南长区");
            Add("江苏省", "无锡市", "北塘区");
            Add("江苏省", "无锡市", "郊区");
            Add("江苏省", "无锡市", "马山区");
            Add("江苏省", "无锡市", "江阴市");
            Add("江苏省", "无锡市", "宜兴市");
            Add("江苏省", "无锡市", "锡山市");
            Add("江苏省", "徐州市", "鼓楼区");
            Add("江苏省", "徐州市", "云龙区");
            Add("江苏省", "徐州市", "九里区");
            Add("江苏省", "徐州市", "贾汪区");
            Add("江苏省", "徐州市", "泉山区");
            Add("江苏省", "徐州市", "丰县");
            Add("江苏省", "徐州市", "沛县");
            Add("江苏省", "徐州市", "铜山县");
            Add("江苏省", "徐州市", "睢宁县");
            Add("江苏省", "徐州市", "新沂市");
            Add("江苏省", "徐州市", "邳州市");
            Add("江苏省", "常州市", "天宁区");
            Add("江苏省", "常州市", "钟楼区");
            Add("江苏省", "常州市", "戚墅堰区");
            Add("江苏省", "常州市", "郊区");
            Add("江苏省", "常州市", "溧阳市");
            Add("江苏省", "常州市", "金坛市");
            Add("江苏省", "常州市", "武进市");
            Add("江苏省", "苏州市", "沧浪区");
            Add("江苏省", "苏州市", "平江区");
            Add("江苏省", "苏州市", "金阊区");
            Add("江苏省", "苏州市", "郊区");
            Add("江苏省", "苏州市", "常熟市");
            Add("江苏省", "苏州市", "张家港市");
            Add("江苏省", "苏州市", "昆山市");
            Add("江苏省", "苏州市", "吴江市");
            Add("江苏省", "苏州市", "太仓市");
            Add("江苏省", "苏州市", "吴县市");
            Add("江苏省", "南通市", "崇川区");
            Add("江苏省", "南通市", "港闸区");
            Add("江苏省", "南通市", "海安县");
            Add("江苏省", "南通市", "如东县");
            Add("江苏省", "南通市", "启东市");
            Add("江苏省", "南通市", "如皋市");
            Add("江苏省", "南通市", "通州市");
            Add("江苏省", "南通市", "海门市");
            Add("江苏省", "连云港市", "连云区");
            Add("江苏省", "连云港市", "云台区");
            Add("江苏省", "连云港市", "新浦区");
            Add("江苏省", "连云港市", "海州区");
            Add("江苏省", "连云港市", "赣榆县");
            Add("江苏省", "连云港市", "东海县");
            Add("江苏省", "连云港市", "灌云县");
            Add("江苏省", "连云港市", "灌南县");
            Add("江苏省", "淮安市(原淮阴市", "清河区");
            Add("江苏省", "淮安市(原淮阴市", "清浦区");
            Add("江苏省", "淮安市(原淮阴市", "淮阴县");
            Add("江苏省", "淮安市(原淮阴市", "涟水县");
            Add("江苏省", "淮安市(原淮阴市", "洪泽县");
            Add("江苏省", "淮安市(原淮阴市", "盱眙县");
            Add("江苏省", "淮安市(原淮阴市", "金湖县");
            Add("江苏省", "淮安市(原淮阴市", "淮安市");
            Add("江苏省", "盐城市", "城区");
            Add("江苏省", "盐城市", "响水县");
            Add("江苏省", "盐城市", "滨海县");
            Add("江苏省", "盐城市", "阜宁县");
            Add("江苏省", "盐城市", "射阳县");
            Add("江苏省", "盐城市", "建湖县");
            Add("江苏省", "盐城市", "盐都县");
            Add("江苏省", "盐城市", "东台市");
            Add("江苏省", "盐城市", "大丰市");
            Add("江苏省", "扬州市", "广陵区");
            Add("江苏省", "扬州市", "郊区");
            Add("江苏省", "扬州市", "宝应县");
            Add("江苏省", "扬州市", "邗江县");
            Add("江苏省", "扬州市", "仪征市");
            Add("江苏省", "扬州市", "高邮市");
            Add("江苏省", "扬州市", "江都市");
            Add("江苏省", "镇江市", "京口区");
            Add("江苏省", "镇江市", "润州区");
            Add("江苏省", "镇江市", "丹徒县");
            Add("江苏省", "镇江市", "丹阳市");
            Add("江苏省", "镇江市", "扬中市");
            Add("江苏省", "镇江市", "句容市");
            Add("江苏省", "泰州市", "海陵区");
            Add("江苏省", "泰州市", "高港区");
            Add("江苏省", "泰州市", "兴化市");
            Add("江苏省", "泰州市", "靖江市");
            Add("江苏省", "泰州市", "泰兴市");
            Add("江苏省", "泰州市", "姜堰市");
            Add("江苏省", "宿迁市", "宿城区");
            Add("江苏省", "宿迁市", "宿豫县");
            Add("江苏省", "宿迁市", "沭阳县");
            Add("江苏省", "宿迁市", "泗阳县");
            Add("江苏省", "宿迁市", "泗洪县");
            Add("浙江省", "杭州市", "上城区");
            Add("浙江省", "杭州市", "下城区");
            Add("浙江省", "杭州市", "江干区");
            Add("浙江省", "杭州市", "拱墅区");
            Add("浙江省", "杭州市", "西湖区");
            Add("浙江省", "杭州市", "滨江区");
            Add("浙江省", "杭州市", "桐庐县");
            Add("浙江省", "杭州市", "淳安县");
            Add("浙江省", "杭州市", "萧山市");
            Add("浙江省", "杭州市", "建德市");
            Add("浙江省", "杭州市", "富阳市");
            Add("浙江省", "杭州市", "余杭市");
            Add("浙江省", "杭州市", "临安市");
            Add("浙江省", "宁波市", "海曙区");
            Add("浙江省", "宁波市", "江东区");
            Add("浙江省", "宁波市", "江北区");
            Add("浙江省", "宁波市", "北仑区");
            Add("浙江省", "宁波市", "镇海区");
            Add("浙江省", "宁波市", "象山县");
            Add("浙江省", "宁波市", "宁海县");
            Add("浙江省", "宁波市", "鄞县");
            Add("浙江省", "宁波市", "余姚市");
            Add("浙江省", "宁波市", "慈溪市");
            Add("浙江省", "宁波市", "奉化市");
            Add("浙江省", "温州市", "鹿城区");
            Add("浙江省", "温州市", "龙湾区");
            Add("浙江省", "温州市", "瓯海区");
            Add("浙江省", "温州市", "洞头县");
            Add("浙江省", "温州市", "永嘉县");
            Add("浙江省", "温州市", "平阳县");
            Add("浙江省", "温州市", "苍南县");
            Add("浙江省", "温州市", "文成县");
            Add("浙江省", "温州市", "泰顺县");
            Add("浙江省", "温州市", "瑞安市");
            Add("浙江省", "温州市", "乐清市");
            Add("浙江省", "嘉兴市", "秀城区");
            Add("浙江省", "嘉兴市", "郊区");
            Add("浙江省", "嘉兴市", "嘉善县");
            Add("浙江省", "嘉兴市", "海盐县");
            Add("浙江省", "嘉兴市", "海宁市");
            Add("浙江省", "嘉兴市", "平湖市");
            Add("浙江省", "嘉兴市", "桐乡市");
            Add("浙江省", "湖州市", "吴兴区");
            Add("浙江省", "湖州市", "南浔区");
            Add("浙江省", "湖州市", "德清县");
            Add("浙江省", "湖州市", "长兴县");
            Add("浙江省", "湖州市", "安吉县");
            Add("浙江省", "绍兴市", "越城区");
            Add("浙江省", "绍兴市", "绍兴县");
            Add("浙江省", "绍兴市", "新昌县");
            Add("浙江省", "绍兴市", "诸暨市");
            Add("浙江省", "绍兴市", "上虞市");
            Add("浙江省", "绍兴市", "嵊州市");
            Add("浙江省", "金华市", "婺城区");
            Add("浙江省", "金华市", "金华县");
            Add("浙江省", "金华市", "武义县");
            Add("浙江省", "金华市", "浦江县");
            Add("浙江省", "金华市", "磐安县");
            Add("浙江省", "金华市", "兰溪市");
            Add("浙江省", "金华市", "义乌市");
            Add("浙江省", "金华市", "东阳市");
            Add("浙江省", "金华市", "永康市");
            Add("浙江省", "衢州市", "柯城区");
            Add("浙江省", "衢州市", "衢县");
            Add("浙江省", "衢州市", "常山县");
            Add("浙江省", "衢州市", "开化县");
            Add("浙江省", "衢州市", "龙游县");
            Add("浙江省", "衢州市", "江山市");
            Add("浙江省", "舟山市", "定海区");
            Add("浙江省", "舟山市", "普陀区");
            Add("浙江省", "舟山市", "岱山县");
            Add("浙江省", "舟山市", "嵊泗县");
            Add("浙江省", "台州市", "椒江区");
            Add("浙江省", "台州市", "黄岩区");
            Add("浙江省", "台州市", "路桥区");
            Add("浙江省", "台州市", "玉环县");
            Add("浙江省", "台州市", "三门县");
            Add("浙江省", "台州市", "天台县");
            Add("浙江省", "台州市", "仙居县");
            Add("浙江省", "台州市", "温岭市");
            Add("浙江省", "台州市", "临海市");
            Add("浙江省", "丽水市", "丽水市");
            Add("浙江省", "丽水市", "龙泉市");
            Add("浙江省", "丽水市", "青田县");
            Add("浙江省", "丽水市", "云和县");
            Add("浙江省", "丽水市", "庆元县");
            Add("浙江省", "丽水市", "缙云县");
            Add("浙江省", "丽水市", "遂昌县");
            Add("浙江省", "丽水市", "松阳县");
            Add("浙江省", "丽水市", "景宁畲族自治县");
            Add("安徽省", "合肥市", "东市区");
            Add("安徽省", "合肥市", "中市区");
            Add("安徽省", "合肥市", "西市区");
            Add("安徽省", "合肥市", "郊区");
            Add("安徽省", "合肥市", "长丰县");
            Add("安徽省", "合肥市", "肥东县");
            Add("安徽省", "合肥市", "肥西县");
            Add("安徽省", "芜湖市", "镜湖区");
            Add("安徽省", "芜湖市", "马塘区");
            Add("安徽省", "芜湖市", "新芜区");
            Add("安徽省", "芜湖市", "鸠江区");
            Add("安徽省", "芜湖市", "芜湖县");
            Add("安徽省", "芜湖市", "繁昌县");
            Add("安徽省", "芜湖市", "南陵县");
            Add("安徽省", "蚌埠市", "东市区");
            Add("安徽省", "蚌埠市", "中市区");
            Add("安徽省", "蚌埠市", "西市区");
            Add("安徽省", "蚌埠市", "郊区");
            Add("安徽省", "蚌埠市", "怀远县");
            Add("安徽省", "蚌埠市", "五河县");
            Add("安徽省", "蚌埠市", "固镇县");
            Add("安徽省", "淮南市", "大通区");
            Add("安徽省", "淮南市", "田家庵区");
            Add("安徽省", "淮南市", "谢家集区");
            Add("安徽省", "淮南市", "八公山区");
            Add("安徽省", "淮南市", "潘集区");
            Add("安徽省", "淮南市", "凤台县");
            Add("安徽省", "马鞍山市", "金家庄区");
            Add("安徽省", "马鞍山市", "花山区");
            Add("安徽省", "马鞍山市", "雨山区");
            Add("安徽省", "马鞍山市", "当涂县");
            Add("安徽省", "淮北市", "杜集区");
            Add("安徽省", "淮北市", "相山区");
            Add("安徽省", "淮北市", "烈山区");
            Add("安徽省", "淮北市", "濉溪县");
            Add("安徽省", "铜陵市", "铜官山区");
            Add("安徽省", "铜陵市", "狮子山区");
            Add("安徽省", "铜陵市", "郊区");
            Add("安徽省", "铜陵市", "铜陵县");
            Add("安徽省", "安庆市", "迎江区");
            Add("安徽省", "安庆市", "大观区");
            Add("安徽省", "安庆市", "郊区");
            Add("安徽省", "安庆市", "怀宁县");
            Add("安徽省", "安庆市", "枞阳县");
            Add("安徽省", "安庆市", "潜山县");
            Add("安徽省", "安庆市", "太湖县");
            Add("安徽省", "安庆市", "宿松县");
            Add("安徽省", "安庆市", "望江县");
            Add("安徽省", "安庆市", "岳西县");
            Add("安徽省", "安庆市", "桐城市");
            Add("安徽省", "黄山市", "屯溪区");
            Add("安徽省", "黄山市", "黄山区");
            Add("安徽省", "黄山市", "徽州区");
            Add("安徽省", "黄山市", "歙县");
            Add("安徽省", "黄山市", "休宁县");
            Add("安徽省", "黄山市", "黟县");
            Add("安徽省", "黄山市", "祁门县");
            Add("安徽省", "滁州市", "琅琊区");
            Add("安徽省", "滁州市", "南谯区");
            Add("安徽省", "滁州市", "来安县");
            Add("安徽省", "滁州市", "全椒县");
            Add("安徽省", "滁州市", "定远县");
            Add("安徽省", "滁州市", "凤阳县");
            Add("安徽省", "滁州市", "天长市");
            Add("安徽省", "滁州市", "明光市");
            Add("安徽省", "阜阳市", "颍州区");
            Add("安徽省", "阜阳市", "颍东区");
            Add("安徽省", "阜阳市", "颍泉区");
            Add("安徽省", "阜阳市", "临泉县");
            Add("安徽省", "阜阳市", "太和县");
            Add("安徽省", "阜阳市", "阜南县");
            Add("安徽省", "阜阳市", "颍上县");
            Add("安徽省", "阜阳市", "界首市");
            Add("安徽省", "宿州市", " 墉桥区");
            Add("安徽省", "宿州市", "砀山县");
            Add("安徽省", "宿州市", "萧县");
            Add("安徽省", "宿州市", "灵璧县");
            Add("安徽省", "宿州市", "泗县");
            Add("安徽省", "六安市", "金安区");
            Add("安徽省", "六安市", "裕安区");
            Add("安徽省", "六安市", "寿县");
            Add("安徽省", "六安市", "霍邱县");
            Add("安徽省", "六安市", "舒城县");
            Add("安徽省", "六安市", "金寨县");
            Add("安徽省", "六安市", "霍山县");
            Add("安徽省", "宣城市", "宣州区");
            Add("安徽省", "宣城市", "宁国市");
            Add("安徽省", "宣城市", "郎溪县");
            Add("安徽省", "宣城市", "广德县");
            Add("安徽省", "宣城市", "泾县");
            Add("安徽省", "宣城市", "旌德县");
            Add("安徽省", "宣城市", "绩溪县");
            Add("安徽省", "巢湖市", "巢湖区");
            Add("安徽省", "巢湖市", "庐江县");
            Add("安徽省", "巢湖市", "无为县");
            Add("安徽省", "巢湖市", "含山县");
            Add("安徽省", "巢湖市", "和县");
            Add("安徽省", "池州市", "贵池区");
            Add("安徽省", "池州市", "东至县");
            Add("安徽省", "池州市", "石台县");
            Add("安徽省", "池州市", "青阳县");
            Add("福建省", "福州市", "鼓楼区");
            Add("福建省", "福州市", "台江区");
            Add("福建省", "福州市", "仓山区");
            Add("福建省", "福州市", "马尾区");
            Add("福建省", "福州市", "晋安区");
            Add("福建省", "福州市", "闽侯县");
            Add("福建省", "福州市", "连江县");
            Add("福建省", "福州市", "罗源县");
            Add("福建省", "福州市", "闽清县");
            Add("福建省", "福州市", "永泰县");
            Add("福建省", "福州市", "平潭县");
            Add("福建省", "福州市", "福清市");
            Add("福建省", "福州市", "长乐市");
            Add("福建省", "厦门市", "思明区 	");
            Add("福建省", "厦门市", "海沧区");
            Add("福建省", "厦门市", "湖里区");
            Add("福建省", "厦门市", "集美区");
            Add("福建省", "厦门市", "同安区");
            Add("福建省", "厦门市", "翔安区");
            Add("福建省", "宁德市", "蕉城区");
            Add("福建省", "宁德市", "霞浦县");
            Add("福建省", "宁德市", "古田县");
            Add("福建省", "宁德市", "屏南县");
            Add("福建省", "宁德市", "寿宁县");
            Add("福建省", "宁德市", "周宁县");
            Add("福建省", "宁德市", "柘荣县");
            Add("福建省", "宁德市", "福安市");
            Add("福建省", "宁德市", "福鼎市");
            Add("福建省", "莆田市", "城厢区");
            Add("福建省", "莆田市", "涵江区");
            Add("福建省", "莆田市", "荔城区");
            Add("福建省", "莆田市", "秀屿区");
            Add("福建省", "莆田市", "仙游县");
            Add("福建省", "泉州市", "鲤城区");
            Add("福建省", "泉州市", "丰泽区");
            Add("福建省", "泉州市", "洛江区");
            Add("福建省", "泉州市", "泉港区");
            Add("福建省", "泉州市", "惠安县");
            Add("福建省", "泉州市", "安溪县");
            Add("福建省", "泉州市", "永春县");
            Add("福建省", "泉州市", "德化县");
            Add("福建省", "泉州市", "金门县");
            Add("福建省", "泉州市", "石狮市");
            Add("福建省", "泉州市", "晋江市");
            Add("福建省", "泉州市", "南安市");
            Add("福建省", "漳州市", "芗城区");
            Add("福建省", "漳州市", "龙文区");
            Add("福建省", "漳州市", "云霄县");
            Add("福建省", "漳州市", "漳浦县");
            Add("福建省", "漳州市", "诏安县");
            Add("福建省", "漳州市", "长泰县");
            Add("福建省", "漳州市", "东山县");
            Add("福建省", "漳州市", "南靖县");
            Add("福建省", "漳州市", "平和县");
            Add("福建省", "漳州市", "华安县");
            Add("福建省", "漳州市", "龙海市");
            Add("福建省", "龙岩", "新罗区");
            Add("福建省", "龙岩", "长汀县");
            Add("福建省", "龙岩", "永定县");
            Add("福建省", "龙岩", "上杭县");
            Add("福建省", "龙岩", "武平县");
            Add("福建省", "龙岩", "连城县");
            Add("福建省", "龙岩", "漳平市");
            Add("福建省", "三明市", "梅列区");
            Add("福建省", "三明市", "三元区");
            Add("福建省", "三明市", "明溪县");
            Add("福建省", "三明市", "清流县");
            Add("福建省", "三明市", "宁化县");
            Add("福建省", "三明市", "大田县");
            Add("福建省", "三明市", "尤溪县");
            Add("福建省", "三明市", "沙　县");
            Add("福建省", "三明市", "将乐县");
            Add("福建省", "三明市", "泰宁县");
            Add("福建省", "三明市", "建宁县");
            Add("福建省", "三明市", "永安市");
            Add("福建省", "南平市", "延平区");
            Add("福建省", "南平市", "顺昌县");
            Add("福建省", "南平市", "浦城县");
            Add("福建省", "南平市", "光泽县");
            Add("福建省", "南平市", "松溪县");
            Add("福建省", "南平市", "政和县");
            Add("福建省", "南平市", "邵武市");
            Add("福建省", "南平市", "武夷山市");
            Add("福建省", "南平市", "建瓯市");
            Add("福建省", "南平市", "建阳市");
            Add("江西省", "南昌市", "东湖区");
            Add("江西省", "南昌市", "西湖区");
            Add("江西省", "南昌市", "青云谱区");
            Add("江西省", "南昌市", "湾里区");
            Add("江西省", "南昌市", "郊区");
            Add("江西省", "南昌市", "南昌县");
            Add("江西省", "南昌市", "新建县");
            Add("江西省", "南昌市", "安义县");
            Add("江西省", "南昌市", "进贤县");
            Add("江西省", "景德镇市", "昌江区");
            Add("江西省", "景德镇市", "珠山区");
            Add("江西省", "景德镇市", "浮梁县");
            Add("江西省", "景德镇市", "乐平市");
            Add("江西省", "萍乡市", "安源区");
            Add("江西省", "萍乡市", "湘东区");
            Add("江西省", "萍乡市", "莲花县");
            Add("江西省", "萍乡市", "上栗县");
            Add("江西省", "萍乡市", "芦溪县");
            Add("江西省", "九江市", "庐山区");
            Add("江西省", "九江市", "浔阳区");
            Add("江西省", "九江市", "九江县");
            Add("江西省", "九江市", "武宁县");
            Add("江西省", "九江市", "修水县");
            Add("江西省", "九江市", "永修县");
            Add("江西省", "九江市", "德安县");
            Add("江西省", "九江市", "星子县");
            Add("江西省", "九江市", "都昌县");
            Add("江西省", "九江市", "湖口县");
            Add("江西省", "九江市", "彭泽县");
            Add("江西省", "九江市", "瑞昌市");
            Add("江西省", "新余市", "渝水区");
            Add("江西省", "新余市", "分宜县");
            Add("江西省", "鹰潭市", "月湖区");
            Add("江西省", "鹰潭市", "余江县");
            Add("江西省", "鹰潭市", "贵溪市");
            Add("江西省", "赣州市", "章贡区");
            Add("江西省", "赣州市", "赣县");
            Add("江西省", "赣州市", "信丰县");
            Add("江西省", "赣州市", "大余县");
            Add("江西省", "赣州市", "上犹县");
            Add("江西省", "赣州市", "崇义县");
            Add("江西省", "赣州市", "安远县");
            Add("江西省", "赣州市", "龙南县");
            Add("江西省", "赣州市", "定南县");
            Add("江西省", "赣州市", "全南县");
            Add("江西省", "赣州市", "宁都县");
            Add("江西省", "赣州市", "于都县");
            Add("江西省", "赣州市", "兴国县");
            Add("江西省", "赣州市", "会昌县");
            Add("江西省", "赣州市", "寻乌县");
            Add("江西省", "赣州市", "石城县");
            Add("江西省", "赣州市", "瑞金市");
            Add("江西省", "赣州市", "南康市");
            Add("江西省", "宜春市", "宜春市");
            Add("江西省", "宜春市", "丰城市");
            Add("江西省", "宜春市", "樟树市");
            Add("江西省", "宜春市", "高安市");
            Add("江西省", "宜春市", "奉新县");
            Add("江西省", "宜春市", "万载县");
            Add("江西省", "宜春市", "上高县");
            Add("江西省", "宜春市", "宜丰县");
            Add("江西省", "宜春市", "靖安县");
            Add("江西省", "宜春市", "铜鼓县");
            Add("江西省", "上饶市", "上饶市");
            Add("江西省", "上饶市", "德兴市");
            Add("江西省", "上饶市", "上饶县");
            Add("江西省", "上饶市", "广丰县");
            Add("江西省", "上饶市", "玉山县");
            Add("江西省", "上饶市", "铅山县");
            Add("江西省", "上饶市", "横峰县");
            Add("江西省", "上饶市", "弋阳县");
            Add("江西省", "上饶市", "余干县");
            Add("江西省", "上饶市", "波阳县");
            Add("江西省", "上饶市", "万年县");
            Add("江西省", "上饶市", "婺源县");
            Add("江西省", "吉安市", "吉安市");
            Add("江西省", "吉安市", "井冈山市");
            Add("江西省", "吉安市", "吉安县");
            Add("江西省", "吉安市", "吉水县");
            Add("江西省", "吉安市", "峡江县");
            Add("江西省", "吉安市", "新干县");
            Add("江西省", "吉安市", "永丰县");
            Add("江西省", "吉安市", "泰和县");
            Add("江西省", "吉安市", "遂川县");
            Add("江西省", "吉安市", "万安县");
            Add("江西省", "吉安市", "安福县");
            Add("江西省", "吉安市", "永新县");
            Add("江西省", "吉安市", "宁冈县");
            Add("江西省", "抚州市", "临川市");
            Add("江西省", "抚州市", "南城县");
            Add("江西省", "抚州市", "黎川县");
            Add("江西省", "抚州市", "南丰县");
            Add("江西省", "抚州市", "崇仁县");
            Add("江西省", "抚州市", "乐安县");
            Add("江西省", "抚州市", "宜黄县");
            Add("江西省", "抚州市", "金溪县");
            Add("江西省", "抚州市", "资溪县");
            Add("江西省", "抚州市", "东乡县");
            Add("江西省", "抚州市", "广昌县");
            Add("山东省", "济南市", "历下区");
            Add("山东省", "济南市", "市中区");
            Add("山东省", "济南市", "槐荫区");
            Add("山东省", "济南市", "天桥区");
            Add("山东省", "济南市", "历城区");
            Add("山东省", "济南市", "长清县");
            Add("山东省", "济南市", "平阴县");
            Add("山东省", "济南市", "济阳县");
            Add("山东省", "济南市", "商河县");
            Add("山东省", "济南市", "章丘市");
            Add("山东省", "青岛市", "市南区");
            Add("山东省", "青岛市", "市北区");
            Add("山东省", "青岛市", "四方区");
            Add("山东省", "青岛市", "黄岛区");
            Add("山东省", "青岛市", "崂山区");
            Add("山东省", "青岛市", "李沧区");
            Add("山东省", "青岛市", "城阳区");
            Add("山东省", "青岛市", "胶州市");
            Add("山东省", "青岛市", "即墨市");
            Add("山东省", "青岛市", "平度市");
            Add("山东省", "青岛市", "胶南市");
            Add("山东省", "青岛市", "莱西市");
            Add("山东省", "淄博市", "淄川区");
            Add("山东省", "淄博市", "张店区");
            Add("山东省", "淄博市", "博山区");
            Add("山东省", "淄博市", "临淄区");
            Add("山东省", "淄博市", "周村区");
            Add("山东省", "淄博市", "桓台县");
            Add("山东省", "淄博市", "高青县");
            Add("山东省", "淄博市", "沂源县");
            Add("山东省", "枣庄市", "市中区");
            Add("山东省", "枣庄市", "薛城区");
            Add("山东省", "枣庄市", "峄城区");
            Add("山东省", "枣庄市", "台儿庄区");
            Add("山东省", "枣庄市", "山亭区");
            Add("山东省", "枣庄市", "滕州市");
            Add("山东省", "东营市", "东营区");
            Add("山东省", "东营市", "河口区");
            Add("山东省", "东营市", "垦利县");
            Add("山东省", "东营市", "利津县");
            Add("山东省", "东营市", "广饶县");
            Add("山东省", "烟台市", "芝罘区");
            Add("山东省", "烟台市", "福山区");
            Add("山东省", "烟台市", "牟平区");
            Add("山东省", "烟台市", "莱山区");
            Add("山东省", "烟台市", "长岛县");
            Add("山东省", "烟台市", "龙口市");
            Add("山东省", "烟台市", "莱阳市");
            Add("山东省", "烟台市", "莱州市");
            Add("山东省", "烟台市", "蓬莱市");
            Add("山东省", "烟台市", "招远市");
            Add("山东省", "烟台市", "栖霞市");
            Add("山东省", "烟台市", "海阳市");
            Add("山东省", "潍坊市", "潍城区");
            Add("山东省", "潍坊市", "寒亭区");
            Add("山东省", "潍坊市", "坊子区");
            Add("山东省", "潍坊市", "奎文区");
            Add("山东省", "潍坊市", "临朐县");
            Add("山东省", "潍坊市", "昌乐县");
            Add("山东省", "潍坊市", "青州市");
            Add("山东省", "潍坊市", "诸城市");
            Add("山东省", "潍坊市", "寿光市");
            Add("山东省", "潍坊市", "安丘市");
            Add("山东省", "潍坊市", "高密市");
            Add("山东省", "潍坊市", "昌邑市");
            Add("山东省", "济宁市", "市中区");
            Add("山东省", "济宁市", "任城区");
            Add("山东省", "济宁市", "微山县");
            Add("山东省", "济宁市", "鱼台县");
            Add("山东省", "济宁市", "金乡县");
            Add("山东省", "济宁市", "嘉祥县");
            Add("山东省", "济宁市", "汶上县");
            Add("山东省", "济宁市", "泗水县");
            Add("山东省", "济宁市", "梁山县");
            Add("山东省", "济宁市", "曲阜市");
            Add("山东省", "济宁市", "兖州市");
            Add("山东省", "济宁市", "邹城市");
            Add("山东省", "泰安市", "泰山区");
            Add("山东省", "泰安市", "郊区");
            Add("山东省", "泰安市", "宁阳县");
            Add("山东省", "泰安市", "东平县");
            Add("山东省", "泰安市", "新泰市");
            Add("山东省", "泰安市", "肥城市");
            Add("山东省", "威海市", "环翠区");
            Add("山东省", "威海市", "文登市");
            Add("山东省", "威海市", "荣成市");
            Add("山东省", "威海市", "乳山市");
            Add("山东省", "日照市", "东港区");
            Add("山东省", "日照市", "岚山区");
            Add("山东省", "日照市", "五莲县");
            Add("山东省", "日照市", "莒县");
            Add("山东省", "莱芜市", "莱城区");
            Add("山东省", "莱芜市", "钢城区");
            Add("山东省", "临沂市", "兰山区");
            Add("山东省", "临沂市", "罗庄区");
            Add("山东省", "临沂市", "河东区");
            Add("山东省", "临沂市", "沂南县");
            Add("山东省", "临沂市", "郯城县");
            Add("山东省", "临沂市", "沂水县");
            Add("山东省", "临沂市", "苍山县");
            Add("山东省", "临沂市", "费县");
            Add("山东省", "临沂市", "平邑县");
            Add("山东省", "临沂市", "莒南县");
            Add("山东省", "临沂市", "蒙阴县");
            Add("山东省", "临沂市", "临沭县");
            Add("山东省", "德州市", "德城区");
            Add("山东省", "德州市", "陵县");
            Add("山东省", "德州市", "宁津县");
            Add("山东省", "德州市", "庆云县");
            Add("山东省", "德州市", "临邑县");
            Add("山东省", "德州市", "齐河县");
            Add("山东省", "德州市", "平原县");
            Add("山东省", "德州市", "夏津县");
            Add("山东省", "德州市", "武城县");
            Add("山东省", "德州市", "乐陵市");
            Add("山东省", "德州市", "禹城市");
            Add("山东省", "聊城市", "东昌府区");
            Add("山东省", "聊城市", "阳谷县");
            Add("山东省", "聊城市", "莘县");
            Add("山东省", "聊城市", "茌平县");
            Add("山东省", "聊城市", "东阿县");
            Add("山东省", "聊城市", "冠县");
            Add("山东省", "聊城市", "高唐县");
            Add("山东省", "聊城市", "临清市");
            Add("山东省", "滨州地区", "滨州市");
            Add("山东省", "滨州地区", "惠民县");
            Add("山东省", "滨州地区", "阳信县");
            Add("山东省", "滨州地区", "无棣县");
            Add("山东省", "滨州地区", "沾化县");
            Add("山东省", "滨州地区", "博兴县");
            Add("山东省", "滨州地区", "邹平县");
            Add("山东省", "菏泽地区", "菏泽市");
            Add("山东省", "菏泽地区", "曹县");
            Add("山东省", "菏泽地区", "定陶县");
            Add("山东省", "菏泽地区", "成武县");
            Add("山东省", "菏泽地区", "单县");
            Add("山东省", "菏泽地区", "巨野县");
            Add("山东省", "菏泽地区", "郓城县");
            Add("山东省", "菏泽地区", "鄄城县");
            Add("山东省", "菏泽地区", "东明县");
            Add("河南省", "郑州市", "中原区");
            Add("河南省", "郑州市", "二七区");
            Add("河南省", "郑州市", "管城回族区");
            Add("河南省", "郑州市", "金水区");
            Add("河南省", "郑州市", "上街区");
            Add("河南省", "郑州市", "邙山区");
            Add("河南省", "郑州市", "中牟县");
            Add("河南省", "郑州市", "巩义市");
            Add("河南省", "郑州市", "荥阳市");
            Add("河南省", "郑州市", "新密市");
            Add("河南省", "郑州市", "新郑市");
            Add("河南省", "郑州市", "登封市");
            Add("河南省", "开封市", "龙亭区");
            Add("河南省", "开封市", "顺河回族区");
            Add("河南省", "开封市", "鼓楼区");
            Add("河南省", "开封市", "南关区");
            Add("河南省", "开封市", "郊区");
            Add("河南省", "开封市", "杞县");
            Add("河南省", "开封市", "通许县");
            Add("河南省", "开封市", "尉氏县");
            Add("河南省", "开封市", "开封县");
            Add("河南省", "开封市", "兰考县");
            Add("河南省", "洛阳市", "老城区");
            Add("河南省", "洛阳市", "西工区");
            Add("河南省", "洛阳市", "廛河回族区");
            Add("河南省", "洛阳市", "涧西区");
            Add("河南省", "洛阳市", "吉利区");
            Add("河南省", "洛阳市", "郊区");
            Add("河南省", "洛阳市", "孟津县");
            Add("河南省", "洛阳市", "新安县");
            Add("河南省", "洛阳市", "栾川县");
            Add("河南省", "洛阳市", "嵩县");
            Add("河南省", "洛阳市", "汝阳县");
            Add("河南省", "洛阳市", "宜阳县");
            Add("河南省", "洛阳市", "洛宁县");
            Add("河南省", "洛阳市", "伊川县");
            Add("河南省", "洛阳市", "偃师市");
            Add("河南省", "平顶山市", "新华区");
            Add("河南省", "平顶山市", "卫东区");
            Add("河南省", "平顶山市", "石龙区");
            Add("河南省", "平顶山市", "湛河区");
            Add("河南省", "平顶山市", "宝丰县");
            Add("河南省", "平顶山市", "叶县");
            Add("河南省", "平顶山市", "鲁山县");
            Add("河南省", "平顶山市", "郏县");
            Add("河南省", "平顶山市", "舞钢市");
            Add("河南省", "平顶山市", "汝州市");
            Add("河南省", "安阳市", "文峰区");
            Add("河南省", "安阳市", "北关区");
            Add("河南省", "安阳市", "铁西区");
            Add("河南省", "安阳市", "郊区");
            Add("河南省", "安阳市", "安阳县");
            Add("河南省", "安阳市", "汤阴县");
            Add("河南省", "安阳市", "滑县");
            Add("河南省", "安阳市", "内黄县");
            Add("河南省", "安阳市", "林州市");
            Add("河南省", "鹤壁市", "鹤山区");
            Add("河南省", "鹤壁市", "山城区");
            Add("河南省", "鹤壁市", "郊区");
            Add("河南省", "鹤壁市", "浚县");
            Add("河南省", "鹤壁市", "淇县");
            Add("河南省", "新乡市", "红旗区");
            Add("河南省", "新乡市", "新华区");
            Add("河南省", "新乡市", "北站区");
            Add("河南省", "新乡市", "郊区");
            Add("河南省", "新乡市", "新乡县");
            Add("河南省", "新乡市", "获嘉县");
            Add("河南省", "新乡市", "原阳县");
            Add("河南省", "新乡市", "延津县");
            Add("河南省", "新乡市", "封丘县");
            Add("河南省", "新乡市", "长垣县");
            Add("河南省", "新乡市", "卫辉市");
            Add("河南省", "新乡市", "辉县市");
            Add("河南省", "焦作市", "解放区");
            Add("河南省", "焦作市", "中站区");
            Add("河南省", "焦作市", "马村区");
            Add("河南省", "焦作市", "山阳区");
            Add("河南省", "焦作市", "修武县");
            Add("河南省", "焦作市", "博爱县");
            Add("河南省", "焦作市", "武陟县");
            Add("河南省", "焦作市", "温县");
            Add("河南省", "焦作市", "沁阳市");
            Add("河南省", "焦作市", "孟州市");
            Add("河南省", "濮阳市", "华龙区");
            Add("河南省", "濮阳市", "清丰县");
            Add("河南省", "濮阳市", "南乐县");
            Add("河南省", "濮阳市", "范县");
            Add("河南省", "濮阳市", "台前县");
            Add("河南省", "濮阳市", "濮阳县");
            Add("河南省", "许昌市", "魏都区");
            Add("河南省", "许昌市", "许昌县");
            Add("河南省", "许昌市", "鄢陵县");
            Add("河南省", "许昌市", "襄城县");
            Add("河南省", "许昌市", "禹州市");
            Add("河南省", "许昌市", "长葛市");
            Add("河南省", "漯河市", "源汇区");
            Add("河南省", "漯河市", "郾城区");
            Add("河南省", "漯河市", "召陵区");
            Add("河南省", "漯河市", "舞阳县");
            Add("河南省", "漯河市", "临颍县");
            Add("河南省", "三门峡市", "湖滨区");
            Add("河南省", "三门峡市", "渑池县");
            Add("河南省", "三门峡市", "陕县");
            Add("河南省", "三门峡市", "卢氏县");
            Add("河南省", "三门峡市", "义马市");
            Add("河南省", "三门峡市", "灵宝市");
            Add("河南省", "南阳市", "宛城区");
            Add("河南省", "南阳市", "卧龙区");
            Add("河南省", "南阳市", "南召县");
            Add("河南省", "南阳市", "方城县");
            Add("河南省", "南阳市", "西峡县");
            Add("河南省", "南阳市", "镇平县");
            Add("河南省", "南阳市", "内乡县");
            Add("河南省", "南阳市", "淅川县");
            Add("河南省", "南阳市", "社旗县");
            Add("河南省", "南阳市", "唐河县");
            Add("河南省", "南阳市", "新野县");
            Add("河南省", "南阳市", "桐柏县");
            Add("河南省", "南阳市", "邓州市");
            Add("河南省", "商丘市", "梁园区");
            Add("河南省", "商丘市", "睢阳区");
            Add("河南省", "商丘市", "民权县");
            Add("河南省", "商丘市", "睢县");
            Add("河南省", "商丘市", "宁陵县");
            Add("河南省", "商丘市", "柘城县");
            Add("河南省", "商丘市", "虞城县");
            Add("河南省", "商丘市", "夏邑县");
            Add("河南省", "商丘市", "永城市");
            Add("河南省", "信阳市", "浉河区");
            Add("河南省", "信阳市", "平桥区");
            Add("河南省", "信阳市", "罗山县");
            Add("河南省", "信阳市", "光山县");
            Add("河南省", "信阳市", "新县");
            Add("河南省", "信阳市", "商城县");
            Add("河南省", "信阳市", "固始县");
            Add("河南省", "信阳市", "潢川县");
            Add("河南省", "信阳市", "淮滨县");
            Add("河南省", "信阳市", "息县");
            Add("河南省", "周口市", "周口市");
            Add("河南省", "周口市", "项城市");
            Add("河南省", "周口市", "扶沟县");
            Add("河南省", "周口市", "西华县");
            Add("河南省", "周口市", "商水县");
            Add("河南省", "周口市", "太康县");
            Add("河南省", "周口市", "鹿邑县");
            Add("河南省", "周口市", "郸城县");
            Add("河南省", "周口市", "淮阳县");
            Add("河南省", "周口市", "沈丘县");
            Add("河南省", "驻马店地区", "驻马店市");
            Add("河南省", "驻马店地区", "确山县");
            Add("河南省", "驻马店地区", "泌阳县");
            Add("河南省", "驻马店地区", "遂平县");
            Add("河南省", "驻马店地区", "西平县");
            Add("河南省", "驻马店地区", "上蔡县");
            Add("河南省", "驻马店地区", "汝南县");
            Add("河南省", "驻马店地区", "平舆县");
            Add("河南省", "驻马店地区", "新蔡县");
            Add("河南省", "驻马店地区", "正阳县");
            Add("河南省", "省直辖行政单位", "济源市");
            Add("湖北省", "武汉市", "江岸区");
            Add("湖北省", "武汉市", "江汉区");
            Add("湖北省", "武汉市", "乔口区");
            Add("湖北省", "武汉市", "汉阳区");
            Add("湖北省", "武汉市", "武昌区");
            Add("湖北省", "武汉市", "青山区");
            Add("湖北省", "武汉市", "洪山区");
            Add("湖北省", "武汉市", "东西湖区");
            Add("湖北省", "武汉市", "汉南区");
            Add("湖北省", "武汉市", "蔡甸区");
            Add("湖北省", "武汉市", "江夏区");
            Add("湖北省", "武汉市", "黄陂区");
            Add("湖北省", "武汉市", "新洲区");
            Add("湖北省", "黄石市", "黄石港区");
            Add("湖北省", "黄石市", "石灰窑区");
            Add("湖北省", "黄石市", "下陆区");
            Add("湖北省", "黄石市", "铁山区");
            Add("湖北省", "黄石市", "阳新县");
            Add("湖北省", "黄石市", "大冶市");
            Add("湖北省", "十堰市", "茅箭区");
            Add("湖北省", "十堰市", "张湾区");
            Add("湖北省", "十堰市", "郧县");
            Add("湖北省", "十堰市", "郧西县");
            Add("湖北省", "十堰市", "竹山县");
            Add("湖北省", "十堰市", "竹溪县");
            Add("湖北省", "十堰市", "房县");
            Add("湖北省", "十堰市", "丹江口市");
            Add("湖北省", "宜昌市", "西陵区");
            Add("湖北省", "宜昌市", "伍家岗区");
            Add("湖北省", "宜昌市", "点军区");
            Add("湖北省", "宜昌市", "虎亭区");
            Add("湖北省", "宜昌市", "宜昌县");
            Add("湖北省", "宜昌市", "远安县");
            Add("湖北省", "宜昌市", "兴山县");
            Add("湖北省", "宜昌市", "秭归县");
            Add("湖北省", "宜昌市", "长阳土家族自治县");
            Add("湖北省", "宜昌市", "五峰土家族自治县");
            Add("湖北省", "宜昌市", "宜都市");
            Add("湖北省", "宜昌市", "当阳市");
            Add("湖北省", "宜昌市", "枝江市");
            Add("湖北省", "襄樊市", "襄城区");
            Add("湖北省", "襄樊市", "樊城区");
            Add("湖北省", "襄樊市", "襄阳县");
            Add("湖北省", "襄樊市", "南漳县");
            Add("湖北省", "襄樊市", "谷城县");
            Add("湖北省", "襄樊市", "保康县");
            Add("湖北省", "襄樊市", "老河口市");
            Add("湖北省", "襄樊市", "枣阳市");
            Add("湖北省", "襄樊市", "宜城市");
            Add("湖北省", "鄂州市", "梁子湖区");
            Add("湖北省", "鄂州市", "华容区");
            Add("湖北省", "鄂州市", "鄂城区");
            Add("湖北省", "荆门市", "东宝区");
            Add("湖北省", "荆门市", "掇刀区");
            Add("湖北省", "荆门市", "京山县");
            Add("湖北省", "荆门市", "沙洋县");
            Add("湖北省", "荆门市", "钟祥市");
            Add("湖北省", "孝感市", "孝南区");
            Add("湖北省", "孝感市", "孝昌县");
            Add("湖北省", "孝感市", "大悟县");
            Add("湖北省", "孝感市", "云梦县");
            Add("湖北省", "孝感市", "应城市");
            Add("湖北省", "孝感市", "安陆市");
            Add("湖北省", "孝感市", "汉川市");
            Add("湖北省", "荆州市", "沙市区");
            Add("湖北省", "荆州市", "荆州区");
            Add("湖北省", "荆州市", "公安县");
            Add("湖北省", "荆州市", "监利县");
            Add("湖北省", "荆州市", "江陵县");
            Add("湖北省", "荆州市", "石首市");
            Add("湖北省", "荆州市", "洪湖市");
            Add("湖北省", "荆州市", "松滋市");
            Add("湖北省", "黄冈市", "黄州区");
            Add("湖北省", "黄冈市", "团风县");
            Add("湖北省", "黄冈市", "红安县");
            Add("湖北省", "黄冈市", "罗田县");
            Add("湖北省", "黄冈市", "英山县");
            Add("湖北省", "黄冈市", "浠水县");
            Add("湖北省", "黄冈市", "蕲春县");
            Add("湖北省", "黄冈市", "黄梅县");
            Add("湖北省", "黄冈市", "麻城市");
            Add("湖北省", "黄冈市", "武穴市");
            Add("湖北省", "咸宁市", " 咸安区");
            Add("湖北省", "咸宁市", "嘉鱼县");
            Add("湖北省", "咸宁市", "通城县");
            Add("湖北省", "咸宁市", "崇阳县");
            Add("湖北省", "咸宁市", "通山县");
            Add("湖北省", "咸宁市", "赤壁市");
            Add("湖北省", "随州市", "曾都区");
            Add("湖北省", "随州市", "随县");
            Add("湖北省", "随州市", "广水市");
            Add("湖北省", "恩施土家族苗族自治州", "恩施市");
            Add("湖北省", "恩施土家族苗族自治州", "利川市");
            Add("湖北省", "恩施土家族苗族自治州", "建始县");
            Add("湖北省", "恩施土家族苗族自治州", "巴东县");
            Add("湖北省", "恩施土家族苗族自治州", "宣恩县");
            Add("湖北省", "恩施土家族苗族自治州", "咸丰县");
            Add("湖北省", "恩施土家族苗族自治州", "来凤县");
            Add("湖北省", "恩施土家族苗族自治州", "鹤峰县");
            Add("湖北省", "省直辖行政单位", "仙桃市");
            Add("湖北省", "省直辖行政单位", "潜江市");
            Add("湖北省", "省直辖行政单位", "天门市");
            Add("湖北省", "省直辖行政单位", "神农架林区");
            Add("湖南省", "长沙市", "芙蓉区");
            Add("湖南省", "长沙市", "天心区");
            Add("湖南省", "长沙市", "岳麓区");
            Add("湖南省", "长沙市", "开福区");
            Add("湖南省", "长沙市", "雨花区");
            Add("湖南省", "长沙市", "长沙县");
            Add("湖南省", "长沙市", "望城县");
            Add("湖南省", "长沙市", "宁乡县");
            Add("湖南省", "长沙市", "浏阳市");
            Add("湖南省", "株洲市", "荷塘区");
            Add("湖南省", "株洲市", "芦淞区");
            Add("湖南省", "株洲市", "石峰区");
            Add("湖南省", "株洲市", "天元区");
            Add("湖南省", "株洲市", "株洲县");
            Add("湖南省", "株洲市", "攸县");
            Add("湖南省", "株洲市", "茶陵县");
            Add("湖南省", "株洲市", "炎陵县");
            Add("湖南省", "株洲市", "醴陵市");
            Add("湖南省", "湘潭市", "雨湖区");
            Add("湖南省", "湘潭市", "岳塘区");
            Add("湖南省", "湘潭市", "湘潭县");
            Add("湖南省", "湘潭市", "湘乡市");
            Add("湖南省", "湘潭市", "韶山市");
            Add("湖南省", "衡阳市", "江东区");
            Add("湖南省", "衡阳市", "城南区");
            Add("湖南省", "衡阳市", "城北区");
            Add("湖南省", "衡阳市", "郊 区");
            Add("湖南省", "衡阳市", "南岳区");
            Add("湖南省", "衡阳市", "衡阳县");
            Add("湖南省", "衡阳市", "衡南县");
            Add("湖南省", "衡阳市", "衡山县");
            Add("湖南省", "衡阳市", "衡东县");
            Add("湖南省", "衡阳市", "祁东县");
            Add("湖南省", "衡阳市", "耒阳市");
            Add("湖南省", "衡阳市", "常宁市");
            Add("湖南省", "邵阳市", "双清区");
            Add("湖南省", "邵阳市", "大祥区");
            Add("湖南省", "邵阳市", "北塔区");
            Add("湖南省", "邵阳市", "邵东县");
            Add("湖南省", "邵阳市", "新邵县");
            Add("湖南省", "邵阳市", "邵阳县");
            Add("湖南省", "邵阳市", "隆回县");
            Add("湖南省", "邵阳市", "洞口县");
            Add("湖南省", "邵阳市", "绥宁县");
            Add("湖南省", "邵阳市", "新宁县");
            Add("湖南省", "邵阳市", "城步苗族自治县");
            Add("湖南省", "邵阳市", "武冈市");
            Add("湖南省", "岳阳市", "岳阳楼区");
            Add("湖南省", "岳阳市", "云溪区");
            Add("湖南省", "岳阳市", "君山区");
            Add("湖南省", "岳阳市", "岳阳县");
            Add("湖南省", "岳阳市", "华容县");
            Add("湖南省", "岳阳市", "湘阴县");
            Add("湖南省", "岳阳市", "平江县");
            Add("湖南省", "岳阳市", "汨罗市");
            Add("湖南省", "岳阳市", "临湘市");
            Add("湖南省", "常德市", "武陵区");
            Add("湖南省", "常德市", "鼎城区");
            Add("湖南省", "常德市", "安乡县");
            Add("湖南省", "常德市", "汉寿县");
            Add("湖南省", "常德市", "澧县");
            Add("湖南省", "常德市", "临澧县");
            Add("湖南省", "常德市", "桃源县");
            Add("湖南省", "常德市", "石门县");
            Add("湖南省", "常德市", "津市市");
            Add("湖南省", "张家界市", "永定区");
            Add("湖南省", "张家界市", "武陵源区");
            Add("湖南省", "张家界市", "慈利县");
            Add("湖南省", "张家界市", "桑植县");
            Add("湖南省", "益阳市", "资阳区");
            Add("湖南省", "益阳市", "赫山区");
            Add("湖南省", "益阳市", "南县");
            Add("湖南省", "益阳市", "桃江县");
            Add("湖南省", "益阳市", "安化县");
            Add("湖南省", "益阳市", "沅江市");
            Add("湖南省", "郴州市", "北湖区");
            Add("湖南省", "郴州市", "苏仙区");
            Add("湖南省", "郴州市", "桂阳县");
            Add("湖南省", "郴州市", "宜章县");
            Add("湖南省", "郴州市", "永兴县");
            Add("湖南省", "郴州市", "嘉禾县");
            Add("湖南省", "郴州市", "临武县");
            Add("湖南省", "郴州市", "汝城县");
            Add("湖南省", "郴州市", "桂东县");
            Add("湖南省", "郴州市", "安仁县");
            Add("湖南省", "郴州市", "资兴市");
            Add("湖南省", "永州市", "芝山区");
            Add("湖南省", "永州市", "冷水滩区");
            Add("湖南省", "永州市", "祁阳县");
            Add("湖南省", "永州市", "东安县");
            Add("湖南省", "永州市", "双牌县");
            Add("湖南省", "永州市", "道县");
            Add("湖南省", "永州市", "江永县");
            Add("湖南省", "永州市", "宁远县");
            Add("湖南省", "永州市", "蓝山县");
            Add("湖南省", "永州市", "新田县");
            Add("湖南省", "永州市", "江华瑶族自治县");
            Add("湖南省", "怀化市", "鹤城区");
            Add("湖南省", "怀化市", "中方县");
            Add("湖南省", "怀化市", "沅陵县");
            Add("湖南省", "怀化市", "辰溪县");
            Add("湖南省", "怀化市", "溆浦县");
            Add("湖南省", "怀化市", "会同县");
            Add("湖南省", "怀化市", "麻阳苗族自治县");
            Add("湖南省", "怀化市", "新晃侗族自治县");
            Add("湖南省", "怀化市", "芷江侗族自治县");
            Add("湖南省", "怀化市", "靖州苗族侗族自治县");
            Add("湖南省", "怀化市", "通道侗族自治县");
            Add("湖南省", "怀化市", "洪江市");
            Add("湖南省", "娄底地区", "娄底市");
            Add("湖南省", "娄底地区", "冷水江市");
            Add("湖南省", "娄底地区", "涟源市");
            Add("湖南省", "娄底地区", "双峰县");
            Add("湖南省", "娄底地区", "新化县");
            Add("湖南省", "湘西土家族苗族自治州", "吉首市");
            Add("湖南省", "湘西土家族苗族自治州", "泸溪县");
            Add("湖南省", "湘西土家族苗族自治州", "凤凰县");
            Add("湖南省", "湘西土家族苗族自治州", "花垣县");
            Add("湖南省", "湘西土家族苗族自治州", "保靖县");
            Add("湖南省", "湘西土家族苗族自治州", "古丈县");
            Add("湖南省", "湘西土家族苗族自治州", "永顺县");
            Add("湖南省", "湘西土家族苗族自治州", "龙山县");
            Add("广东省", "广州市", "东山区");
            Add("广东省", "广州市", "荔湾区");
            Add("广东省", "广州市", "越秀区");
            Add("广东省", "广州市", "海珠区");
            Add("广东省", "广州市", "天河区");
            Add("广东省", "广州市", "芳村区");
            Add("广东省", "广州市", "白云区");
            Add("广东省", "广州市", "黄埔区");
            Add("广东省", "广州市", "番禺市");
            Add("广东省", "广州市", "花都市");
            Add("广东省", "广州市", "增城市");
            Add("广东省", "广州市", "从化市");
            Add("广东省", "韶关市", "武江区");
            Add("广东省", "韶关市", "浈江区");
            Add("广东省", "韶关市", "曲江区");
            Add("广东省", "韶关市", "始兴县");
            Add("广东省", "韶关市", "仁化县");
            Add("广东省", "韶关市", "翁源县");
            Add("广东省", "韶关市", "乳源瑶族自治县");
            Add("广东省", "韶关市", "新丰县");
            Add("广东省", "韶关市", "乐昌市");
            Add("广东省", "韶关市", "南雄市");
            Add("广东省", "深圳市", "罗湖区");
            Add("广东省", "深圳市", "福田区");
            Add("广东省", "深圳市", "南山区");
            Add("广东省", "深圳市", "宝安区");
            Add("广东省", "深圳市", "龙岗区");
            Add("广东省", "深圳市", "盐田区");
            Add("广东省", "珠海市", "香洲区");
            Add("广东省", "珠海市", "斗门区");
            Add("广东省", "珠海市", "金湾区");
            Add("广东省", "汕头市", "濠江区");
            Add("广东省", "汕头市", "龙湖区");
            Add("广东省", "汕头市", "金平区");
            Add("广东省", "汕头市", "潮南区");
            Add("广东省", "汕头市", "澄海区");
            Add("广东省", "汕头市", "潮阳区");
            Add("广东省", "汕头市", "南澳县");
            Add("广东省", "佛山市", "禅城区");
            Add("广东省", "佛山市", "顺德区");
            Add("广东省", "佛山市", "南海区");
            Add("广东省", "佛山市", "三水区");
            Add("广东省", "佛山市", "高明区");
            Add("广东省", "江门市", "蓬江区");
            Add("广东省", "江门市", "江海区");
            Add("广东省", "江门市", "台山市");
            Add("广东省", "江门市", "新会市");
            Add("广东省", "江门市", "开平市");
            Add("广东省", "江门市", "鹤山市");
            Add("广东省", "江门市", "恩平市");
            Add("广东省", "湛江市", "赤坎区");
            Add("广东省", "湛江市", "霞山区");
            Add("广东省", "湛江市", "坡头区");
            Add("广东省", "湛江市", "麻章区");
            Add("广东省", "湛江市", "遂溪县");
            Add("广东省", "湛江市", "徐闻县");
            Add("广东省", "湛江市", "廉江市");
            Add("广东省", "湛江市", "雷州市");
            Add("广东省", "湛江市", "吴川市");
            Add("广东省", "茂名市", "茂南区");
            Add("广东省", "茂名市", "茂港区");
            Add("广东省", "茂名市", "电白县");
            Add("广东省", "茂名市", "高州市");
            Add("广东省", "茂名市", "化州市");
            Add("广东省", "茂名市", "信宜市");
            Add("广东省", "肇庆市", "端州区");
            Add("广东省", "肇庆市", "鼎湖区");
            Add("广东省", "肇庆市", "广宁县");
            Add("广东省", "肇庆市", "怀集县");
            Add("广东省", "肇庆市", "封开县");
            Add("广东省", "肇庆市", "德庆县");
            Add("广东省", "肇庆市", "高要市");
            Add("广东省", "肇庆市", "四会市");
            Add("广东省", "惠州市", "惠城区");
            Add("广东省", "惠州市", "博罗县");
            Add("广东省", "惠州市", "惠东县");
            Add("广东省", "惠州市", "龙门县");
            Add("广东省", "惠州市", "惠阳市");
            Add("广东省", "梅州市", "梅江区");
            Add("广东省", "梅州市", "梅县");
            Add("广东省", "梅州市", "大埔县");
            Add("广东省", "梅州市", "丰顺县");
            Add("广东省", "梅州市", "五华县");
            Add("广东省", "梅州市", "平远县");
            Add("广东省", "梅州市", "蕉岭县");
            Add("广东省", "梅州市", "兴宁市");
            Add("广东省", "汕尾市", "城区");
            Add("广东省", "汕尾市", "海丰县");
            Add("广东省", "汕尾市", "陆河县");
            Add("广东省", "汕尾市", "陆丰市");
            Add("广东省", "河源市", "源城区");
            Add("广东省", "河源市", "紫金县");
            Add("广东省", "河源市", "龙川县");
            Add("广东省", "河源市", "连平县");
            Add("广东省", "河源市", "和平县");
            Add("广东省", "河源市", "东源县");
            Add("广东省", "阳江市", "江城区");
            Add("广东省", "阳江市", "阳西县");
            Add("广东省", "阳江市", "阳东县");
            Add("广东省", "阳江市", "阳春市");
            Add("广东省", "清远市", "清城区");
            Add("广东省", "清远市", "佛冈县");
            Add("广东省", "清远市", "阳山县");
            Add("广东省", "清远市", "连山壮族瑶族自治县");
            Add("广东省", "清远市", "连南瑶族自治县");
            Add("广东省", "清远市", "清新县");
            Add("广东省", "清远市", "英德市");
            Add("广东省", "清远市", "连州市");
            Add("广东省", "东莞市", "莞城区");
            Add("广东省", "东莞市", "南城区");
            Add("广东省", "东莞市", "东城区");
            Add("广东省", "东莞市", "万江区");
            Add("广东省", "中山市", "中山市");
            Add("广东省", "潮州市", "湘桥区");
            Add("广东省", "潮州市", "潮安县");
            Add("广东省", "潮州市", "饶平县");
            Add("广东省", "揭阳市", "榕城区");
            Add("广东省", "揭阳市", "揭东县");
            Add("广东省", "揭阳市", "揭西县");
            Add("广东省", "揭阳市", "惠来县");
            Add("广东省", "揭阳市", "普宁市");
            Add("广东省", "云浮市", "云城区");
            Add("广东省", "云浮市", "新兴县");
            Add("广东省", "云浮市", "郁南县");
            Add("广东省", "云浮市", "云安县");
            Add("广东省", "云浮市", "罗定市");
            Add("广西省", "南宁市", "兴宁区");
            Add("广西省", "南宁市", "青秀区");
            Add("广西省", "南宁市", "西乡塘区");
            Add("广西省", "南宁市", "江南区");
            Add("广西省", "南宁市", "良庆区");
            Add("广西省", "南宁市", "邕宁区");
            Add("广西省", "南宁市", "武鸣县");
            Add("广西省", "南宁市", "隆安县");
            Add("广西省", "南宁市", "马山县");
            Add("广西省", "南宁市", "上林县");
            Add("广西省", "南宁市", "宾阳县");
            Add("广西省", "南宁市", "横　县");
            Add("广西省", "柳州市", "城中区");
            Add("广西省", "柳州市", "鱼峰区");
            Add("广西省", "柳州市", "柳南区");
            Add("广西省", "柳州市", "柳北区");
            Add("广西省", "柳州市", "柳江县");
            Add("广西省", "柳州市", "柳城县");
            Add("广西省", "柳州市", "鹿寨县");
            Add("广西省", "柳州市", "融安县");
            Add("广西省", "柳州市", "融水苗族自治县");
            Add("广西省", "柳州市", "三江侗族自治县");
            Add("广西省", "桂林市", "秀峰区");
            Add("广西省", "桂林市", "叠彩区");
            Add("广西省", "桂林市", "象山区");
            Add("广西省", "桂林市", "七星区");
            Add("广西省", "桂林市", "雁山区");
            Add("广西省", "桂林市", "阳朔县");
            Add("广西省", "桂林市", "临桂县");
            Add("广西省", "桂林市", "灵川县");
            Add("广西省", "桂林市", "全州县");
            Add("广西省", "桂林市", "兴安县");
            Add("广西省", "桂林市", "永福县");
            Add("广西省", "桂林市", "灌阳县");
            Add("广西省", "桂林市", "龙胜各县自治区");
            Add("广西省", "桂林市", "资源县");
            Add("广西省", "桂林市", "平乐县");
            Add("广西省", "桂林市", "荔蒲县");
            Add("广西省", "桂林市", "恭城瑶族自治县");
            Add("广西省", "梧州市", "万秀区");
            Add("广西省", "梧州市", "蝶山区");
            Add("广西省", "梧州市", "市郊区");
            Add("广西省", "梧州市", "苍梧县");
            Add("广西省", "梧州市", "藤县");
            Add("广西省", "梧州市", "蒙山县");
            Add("广西省", "梧州市", "岑溪市");
            Add("广西省", "北海市", "海城区");
            Add("广西省", "北海市", "银海区");
            Add("广西省", "北海市", "铁山港区");
            Add("广西省", "北海市", "合浦县");
            Add("广西省", "防城港市", "港口区");
            Add("广西省", "防城港市", "防城区");
            Add("广西省", "防城港市", "上思县");
            Add("广西省", "防城港市", "东兴市");
            Add("广西省", "钦州市", "钦南区");
            Add("广西省", "钦州市", "钦北区");
            Add("广西省", "钦州市", "浦北县");
            Add("广西省", "钦州市", "灵山县");
            Add("广西省", "贵港市", "港北区");
            Add("广西省", "贵港市", "港南区");
            Add("广西省", "贵港市", "覃塘区");
            Add("广西省", "贵港市", "平南县");
            Add("广西省", "贵港市", "桂平市");
            Add("广西省", "玉林市", "玉州区");
            Add("广西省", "玉林市", "容县");
            Add("广西省", "玉林市", "陆川县");
            Add("广西省", "玉林市", "博白县");
            Add("广西省", "玉林市", "兴业县");
            Add("广西省", "玉林市", "北流市");
            Add("广西省", "崇左市", "江州区");
            Add("广西省", "崇左市", "凭祥市");
            Add("广西省", "崇左市", "扶绥县");
            Add("广西省", "崇左市", "宁明县");
            Add("广西省", "崇左市", "龙州县");
            Add("广西省", "崇左市", "大新县");
            Add("广西省", "崇左市", "天等县");
            Add("广西省", "来宾市", "兴宾区");
            Add("广西省", "来宾市", "合山市");
            Add("广西省", "来宾市", "忻城县");
            Add("广西省", "来宾市", "象州县");
            Add("广西省", "来宾市", "武宣县");
            Add("广西省", "来宾市", "金秀瑶族自治县");
            Add("广西省", "贺州市", "八步区");
            Add("广西省", "贺州市", "昭平县");
            Add("广西省", "贺州市", "钟山县");
            Add("广西省", "贺州市", "富川瑶族自治县");
            Add("广西省", "百色市", "右江区");
            Add("广西省", "百色市", "田阳县");
            Add("广西省", "百色市", "田东县");
            Add("广西省", "百色市", "平果县");
            Add("广西省", "百色市", "德保县");
            Add("广西省", "百色市", "靖西县");
            Add("广西省", "百色市", "那坡县");
            Add("广西省", "百色市", "凌云县");
            Add("广西省", "百色市", "乐业县");
            Add("广西省", "百色市", "田林县");
            Add("广西省", "百色市", "隆林各族自治县");
            Add("广西省", "百色市", "西林县");
            Add("广西省", "河池市", "金城江区");
            Add("广西省", "河池市", "宜州市");
            Add("广西省", "河池市", "罗城仫佬族自治县");
            Add("广西省", "河池市", "环江毛南族自治县");
            Add("广西省", "河池市", "南丹县");
            Add("广西省", "河池市", "天峨县");
            Add("广西省", "河池市", "凤山县");
            Add("广西省", "河池市", "东兰县");
            Add("广西省", "河池市", "巴马瑶族自治县");
            Add("广西省", "河池市", "都安瑶族自治县");
            Add("广西省", "河池市", "大化瑶族自治县");
            Add("海南省", "省直辖行政单位", "琼海市");
            Add("海南省", "省直辖行政单位", "儋州市");
            Add("海南省", "省直辖行政单位", "五指山市");
            Add("海南省", "省直辖行政单位", "文昌市");
            Add("海南省", "省直辖行政单位", "万宁市");
            Add("海南省", "省直辖行政单位", "东方市");
            Add("海南省", "省直辖行政单位", "定安县");
            Add("海南省", "省直辖行政单位", "屯昌县");
            Add("海南省", "省直辖行政单位", "澄迈县");
            Add("海南省", "省直辖行政单位", "临高县");
            Add("海南省", "省直辖行政单位", "白沙黎族自治县");
            Add("海南省", "省直辖行政单位", "昌江黎族自治县");
            Add("海南省", "省直辖行政单位", "乐东黎族自治县");
            Add("海南省", "省直辖行政单位", "陵水黎族自治县");
            Add("海南省", "省直辖行政单位", "保亭黎族苗族自治县");
            Add("海南省", "省直辖行政单位", "琼中黎族苗族自治县");
            Add("海南省", "省直辖行政单位", "西南中沙群岛办事处");
            Add("海南省", "海口市", "龙华区");
            Add("海南省", "海口市", "秀英区");
            Add("海南省", "海口市", "琼山区");
            Add("海南省", "海口市", "美兰区");
            Add("海南省", "三亚市", "市辖区");
            Add("直辖市", "重庆市", "万州区");
            Add("直辖市", "重庆市", "涪陵区");
            Add("直辖市", "重庆市", "渝中区");
            Add("直辖市", "重庆市", "大渡口区");
            Add("直辖市", "重庆市", "江北区");
            Add("直辖市", "重庆市", "沙坪坝区");
            Add("直辖市", "重庆市", "九龙坡区");
            Add("直辖市", "重庆市", "南岸区");
            Add("直辖市", "重庆市", "北碚区");
            Add("直辖市", "重庆市", "万盛区");
            Add("直辖市", "重庆市", "双桥区");
            Add("直辖市", "重庆市", "渝北区");
            Add("直辖市", "重庆市", "巴南区");
            Add("直辖市", "重庆市", "长寿县");
            Add("直辖市", "重庆市", "綦江县");
            Add("直辖市", "重庆市", "潼南县");
            Add("直辖市", "重庆市", "铜梁县");
            Add("直辖市", "重庆市", "大足县");
            Add("直辖市", "重庆市", "荣昌县");
            Add("直辖市", "重庆市", "璧山县");
            Add("直辖市", "重庆市", "梁平县");
            Add("直辖市", "重庆市", "城口县");
            Add("直辖市", "重庆市", "丰都县");
            Add("直辖市", "重庆市", "垫江县");
            Add("直辖市", "重庆市", "武隆县");
            Add("直辖市", "重庆市", "忠县");
            Add("直辖市", "重庆市", "开县");
            Add("直辖市", "重庆市", "云阳县");
            Add("直辖市", "重庆市", "奉节县");
            Add("直辖市", "重庆市", "巫山县");
            Add("直辖市", "重庆市", "巫溪县");
            Add("直辖市", "重庆市", "黔江土家族苗族自治县");
            Add("直辖市", "重庆市", "石柱土家族自治县");
            Add("直辖市", "重庆市", "秀山土家族苗族自治县");
            Add("直辖市", "重庆市", "酉阳土家族苗族自治县");
            Add("直辖市", "重庆市", "彭水苗族土家族自治县");
            Add("直辖市", "重庆市", "江津市");
            Add("直辖市", "重庆市", "合川市");
            Add("直辖市", "重庆市", "永川市");
            Add("直辖市", "重庆市", "南川市");
            Add("四川省", "成都市", "锦江区");
            Add("四川省", "成都市", "青羊区");
            Add("四川省", "成都市", "金牛区");
            Add("四川省", "成都市", "武侯区");
            Add("四川省", "成都市", "成华区");
            Add("四川省", "成都市", "龙泉驿区");
            Add("四川省", "成都市", "青白江区");
            Add("四川省", "成都市", "金堂县");
            Add("四川省", "成都市", "双流县");
            Add("四川省", "成都市", "温江县");
            Add("四川省", "成都市", "郫县");
            Add("四川省", "成都市", "新都县");
            Add("四川省", "成都市", "大邑县");
            Add("四川省", "成都市", "蒲江县");
            Add("四川省", "成都市", "新津县");
            Add("四川省", "成都市", "都江堰市");
            Add("四川省", "成都市", "彭州市");
            Add("四川省", "成都市", "邛崃市");
            Add("四川省", "成都市", "崇州市");
            Add("四川省", "自贡市", "自流井区");
            Add("四川省", "自贡市", "贡井区");
            Add("四川省", "自贡市", "大安区");
            Add("四川省", "自贡市", "沿滩区");
            Add("四川省", "自贡市", "荣县");
            Add("四川省", "自贡市", "富顺县");
            Add("四川省", "攀枝花市", "东区");
            Add("四川省", "攀枝花市", "西区");
            Add("四川省", "攀枝花市", "仁和区");
            Add("四川省", "攀枝花市", "米易县");
            Add("四川省", "攀枝花市", "盐边县");
            Add("四川省", "泸州市", "江阳区");
            Add("四川省", "泸州市", "纳溪区");
            Add("四川省", "泸州市", "龙马潭区");
            Add("四川省", "泸州市", "泸县");
            Add("四川省", "泸州市", "合江县");
            Add("四川省", "泸州市", "叙永县");
            Add("四川省", "泸州市", "古蔺县");
            Add("四川省", "德阳市", "旌阳区");
            Add("四川省", "德阳市", "中江县");
            Add("四川省", "德阳市", "罗江县");
            Add("四川省", "德阳市", "广汉市");
            Add("四川省", "德阳市", "什邡市");
            Add("四川省", "德阳市", "绵竹市");
            Add("四川省", "绵阳市", "涪城区");
            Add("四川省", "绵阳市", "游仙区");
            Add("四川省", "绵阳市", "三台县");
            Add("四川省", "绵阳市", "盐亭县");
            Add("四川省", "绵阳市", "安县");
            Add("四川省", "绵阳市", "梓潼县");
            Add("四川省", "绵阳市", "北川县");
            Add("四川省", "绵阳市", "平武县");
            Add("四川省", "绵阳市", "江油市");
            Add("四川省", "广元市", "利州区");
            Add("四川省", "广元市", "元坝区");
            Add("四川省", "广元市", "朝天区");
            Add("四川省", "广元市", "旺苍县");
            Add("四川省", "广元市", "青川县");
            Add("四川省", "广元市", "剑阁县");
            Add("四川省", "广元市", "苍溪县");
            Add("四川省", "遂宁市", "船山区");
            Add("四川省", "遂宁市", "　安居区");
            Add("四川省", "遂宁市", "蓬溪县");
            Add("四川省", "遂宁市", "射洪县");
            Add("四川省", "遂宁市", "大英县");
            Add("四川省", "内江市", "市中区");
            Add("四川省", "内江市", "东兴区");
            Add("四川省", "内江市", "威远县");
            Add("四川省", "内江市", "资中县");
            Add("四川省", "内江市", "隆昌县");
            Add("四川省", "乐山市", "市中区");
            Add("四川省", "乐山市", "沙湾区");
            Add("四川省", "乐山市", "五通桥区");
            Add("四川省", "乐山市", "金口河区");
            Add("四川省", "乐山市", "犍为县");
            Add("四川省", "乐山市", "井研县");
            Add("四川省", "乐山市", "夹江县");
            Add("四川省", "乐山市", "沐川县");
            Add("四川省", "乐山市", "峨边彝族自治县");
            Add("四川省", "乐山市", "马边彝族自治县");
            Add("四川省", "乐山市", "峨眉山市");
            Add("四川省", "南充市", "顺庆区");
            Add("四川省", "南充市", "高坪区");
            Add("四川省", "南充市", "嘉陵区");
            Add("四川省", "南充市", "南部县");
            Add("四川省", "南充市", "营山县");
            Add("四川省", "南充市", "蓬安县");
            Add("四川省", "南充市", "仪陇县");
            Add("四川省", "南充市", "西充县");
            Add("四川省", "南充市", "阆中市");
            Add("四川省", "宜宾市", "翠屏区");
            Add("四川省", "宜宾市", "宜宾县");
            Add("四川省", "宜宾市", "南溪县");
            Add("四川省", "宜宾市", "江安县");
            Add("四川省", "宜宾市", "长宁县");
            Add("四川省", "宜宾市", "高县");
            Add("四川省", "宜宾市", "珙县");
            Add("四川省", "宜宾市", "筠连县");
            Add("四川省", "宜宾市", "兴文县");
            Add("四川省", "宜宾市", "屏山县");
            Add("四川省", "广安市", "广安区");
            Add("四川省", "广安市", " 岳池县");
            Add("四川省", "广安市", " 武胜县");
            Add("四川省", "广安市", " 邻水县");
            Add("四川省", "广安市", " 华莹市");
            Add("四川省", "达川地区", "达川市");
            Add("四川省", "达川地区", "万源市");
            Add("四川省", "达川地区", "达县");
            Add("四川省", "达川地区", "宣汉县");
            Add("四川省", "达川地区", "开江县");
            Add("四川省", "达川地区", "大竹县");
            Add("四川省", "达川地区", "渠县");
            Add("四川省", "雅安地区", "雅安市");
            Add("四川省", "雅安地区", "名山县");
            Add("四川省", "雅安地区", "荥经县");
            Add("四川省", "雅安地区", "汉源县");
            Add("四川省", "雅安地区", "石棉县");
            Add("四川省", "雅安地区", "天全县");
            Add("四川省", "雅安地区", "芦山县");
            Add("四川省", "雅安地区", "宝兴县");
            Add("四川省", "阿坝藏族羌族自治州", "汶川县");
            Add("四川省", "阿坝藏族羌族自治州", "理县");
            Add("四川省", "阿坝藏族羌族自治州", "茂县");
            Add("四川省", "阿坝藏族羌族自治州", "松潘县");
            Add("四川省", "阿坝藏族羌族自治州", "九寨沟县");
            Add("四川省", "阿坝藏族羌族自治州", "金川县");
            Add("四川省", "阿坝藏族羌族自治州", "小金县");
            Add("四川省", "阿坝藏族羌族自治州", "黑水县");
            Add("四川省", "阿坝藏族羌族自治州", "马尔康县");
            Add("四川省", "阿坝藏族羌族自治州", "壤塘县");
            Add("四川省", "阿坝藏族羌族自治州", "阿坝县");
            Add("四川省", "阿坝藏族羌族自治州", "若尔盖县");
            Add("四川省", "阿坝藏族羌族自治州", "红原县");
            Add("四川省", "甘孜藏族自治州", "康定县");
            Add("四川省", "甘孜藏族自治州", "泸定县");
            Add("四川省", "甘孜藏族自治州", "丹巴县");
            Add("四川省", "甘孜藏族自治州", "九龙县");
            Add("四川省", "甘孜藏族自治州", "雅江县");
            Add("四川省", "甘孜藏族自治州", "道孚县");
            Add("四川省", "甘孜藏族自治州", "炉霍县");
            Add("四川省", "甘孜藏族自治州", "甘孜县");
            Add("四川省", "甘孜藏族自治州", "新龙县");
            Add("四川省", "甘孜藏族自治州", "德格县");
            Add("四川省", "甘孜藏族自治州", "白玉县");
            Add("四川省", "甘孜藏族自治州", "石渠县");
            Add("四川省", "甘孜藏族自治州", "色达县");
            Add("四川省", "甘孜藏族自治州", "理塘县");
            Add("四川省", "甘孜藏族自治州", "巴塘县");
            Add("四川省", "甘孜藏族自治州", "乡城县");
            Add("四川省", "甘孜藏族自治州", "稻城县");
            Add("四川省", "甘孜藏族自治州", "得荣县");
            Add("四川省", "凉山彝族自治州", "西昌市");
            Add("四川省", "凉山彝族自治州", "木里藏族自治县");
            Add("四川省", "凉山彝族自治州", "盐源县");
            Add("四川省", "凉山彝族自治州", "德昌县");
            Add("四川省", "凉山彝族自治州", "会理县");
            Add("四川省", "凉山彝族自治州", "会东县");
            Add("四川省", "凉山彝族自治州", "宁南县");
            Add("四川省", "凉山彝族自治州", "普格县");
            Add("四川省", "凉山彝族自治州", "布拖县");
            Add("四川省", "凉山彝族自治州", "金阳县");
            Add("四川省", "凉山彝族自治州", "昭觉县");
            Add("四川省", "凉山彝族自治州", "喜德县");
            Add("四川省", "凉山彝族自治州", "冕宁县");
            Add("四川省", "凉山彝族自治州", "越西县");
            Add("四川省", "凉山彝族自治州", "甘洛县");
            Add("四川省", "凉山彝族自治州", "美姑县");
            Add("四川省", "凉山彝族自治州", "雷波县");
            Add("四川省", "巴中地区", "巴中市");
            Add("四川省", "巴中地区", "通江县");
            Add("四川省", "巴中地区", "南江县");
            Add("四川省", "巴中地区", "平昌县");
            Add("四川省", "眉山地区", "眉山县");
            Add("四川省", "眉山地区", "仁寿县");
            Add("四川省", "眉山地区", "彭山县");
            Add("四川省", "眉山地区", "洪雅县");
            Add("四川省", "眉山地区", "丹棱县");
            Add("四川省", "眉山地区", "青神县");
            Add("四川省", "资阳地区", "资阳市");
            Add("四川省", "资阳地区", "简阳市");
            Add("四川省", "资阳地区", "安岳县");
            Add("四川省", "资阳地区", "乐至县");
            Add("贵州省", "贵阳市", "南明区");
            Add("贵州省", "贵阳市", "云岩区");
            Add("贵州省", "贵阳市", "花溪区");
            Add("贵州省", "贵阳市", "乌当区");
            Add("贵州省", "贵阳市", "白云区");
            Add("贵州省", "贵阳市", "小河区");
            Add("贵州省", "贵阳市", "开阳县");
            Add("贵州省", "贵阳市", "息烽县");
            Add("贵州省", "贵阳市", "修文县");
            Add("贵州省", "贵阳市", "清镇市");
            Add("贵州省", "六盘水市", "钟山区");
            Add("贵州省", "六盘水市", "盘县特区");
            Add("贵州省", "六盘水市", "六枝特区");
            Add("贵州省", "六盘水市", "水城县");
            Add("贵州省", "遵义市", "红花岗区");
            Add("贵州省", "遵义市", "汇川区");
            Add("贵州省", "遵义市", "遵义县");
            Add("贵州省", "遵义市", "桐梓县");
            Add("贵州省", "遵义市", "绥阳县");
            Add("贵州省", "遵义市", "正安县");
            Add("贵州省", "遵义市", "道真仡佬族苗族自治县");
            Add("贵州省", "遵义市", "务川仡佬族苗族自治县");
            Add("贵州省", "遵义市", "凤冈县");
            Add("贵州省", "遵义市", "湄潭县");
            Add("贵州省", "遵义市", "余庆县");
            Add("贵州省", "遵义市", "习水县");
            Add("贵州省", "遵义市", "赤水市");
            Add("贵州省", "遵义市", "仁怀市");
            Add("贵州省", "铜仁地区", "铜仁市");
            Add("贵州省", "铜仁地区", "江口县");
            Add("贵州省", "铜仁地区", "玉屏侗族自治县");
            Add("贵州省", "铜仁地区", "石阡县");
            Add("贵州省", "铜仁地区", "思南县");
            Add("贵州省", "铜仁地区", "印江土家族苗族自治县");
            Add("贵州省", "铜仁地区", "德江县");
            Add("贵州省", "铜仁地区", "沿河土家族自治县");
            Add("贵州省", "铜仁地区", "松桃苗族自治县");
            Add("贵州省", "铜仁地区", "万山特区");
            Add("贵州省", "黔西南布依族苗族自治州", "兴义市");
            Add("贵州省", "黔西南布依族苗族自治州", "兴仁县");
            Add("贵州省", "黔西南布依族苗族自治州", "普安县");
            Add("贵州省", "黔西南布依族苗族自治州", "晴隆县");
            Add("贵州省", "黔西南布依族苗族自治州", "贞丰县");
            Add("贵州省", "黔西南布依族苗族自治州", "望谟县");
            Add("贵州省", "黔西南布依族苗族自治州", "册亨县");
            Add("贵州省", "黔西南布依族苗族自治州", "安龙县");
            Add("贵州省", "毕节地区", "毕节市");
            Add("贵州省", "毕节地区", "大方县");
            Add("贵州省", "毕节地区", "黔西县");
            Add("贵州省", "毕节地区", "金沙县");
            Add("贵州省", "毕节地区", "织金县");
            Add("贵州省", "毕节地区", "纳雍县");
            Add("贵州省", "毕节地区", "威宁彝族回族苗族自治县");
            Add("贵州省", "毕节地区", "赫章县");
            Add("贵州省", "安顺地区", "安顺市");
            Add("贵州省", "安顺地区", "平坝县");
            Add("贵州省", "安顺地区", "普定县");
            Add("贵州省", "安顺地区", "关岭布依族苗族自治县");
            Add("贵州省", "安顺地区", "镇宁布依族苗族自治县");
            Add("贵州省", "安顺地区", "紫云苗族布依族自治县");
            Add("贵州省", "黔东南苗族侗族自治州", "凯里市");
            Add("贵州省", "黔东南苗族侗族自治州", "黄平县");
            Add("贵州省", "黔东南苗族侗族自治州", "施秉县");
            Add("贵州省", "黔东南苗族侗族自治州", "三穗县");
            Add("贵州省", "黔东南苗族侗族自治州", "镇远县");
            Add("贵州省", "黔东南苗族侗族自治州", "岑巩县");
            Add("贵州省", "黔东南苗族侗族自治州", "天柱县");
            Add("贵州省", "黔东南苗族侗族自治州", "锦屏县");
            Add("贵州省", "黔东南苗族侗族自治州", "剑河县");
            Add("贵州省", "黔东南苗族侗族自治州", "台江县");
            Add("贵州省", "黔东南苗族侗族自治州", "黎平县");
            Add("贵州省", "黔东南苗族侗族自治州", "榕江县");
            Add("贵州省", "黔东南苗族侗族自治州", "从江县");
            Add("贵州省", "黔东南苗族侗族自治州", "雷山县");
            Add("贵州省", "黔东南苗族侗族自治州", "麻江县");
            Add("贵州省", "黔东南苗族侗族自治州", "丹寨县");
            Add("贵州省", "黔南布依族苗族自治州", "都匀市");
            Add("贵州省", "黔南布依族苗族自治州", "福泉市");
            Add("贵州省", "黔南布依族苗族自治州", "荔波县");
            Add("贵州省", "黔南布依族苗族自治州", "贵定县");
            Add("贵州省", "黔南布依族苗族自治州", "瓮安县");
            Add("贵州省", "黔南布依族苗族自治州", "独山县");
            Add("贵州省", "黔南布依族苗族自治州", "平塘县");
            Add("贵州省", "黔南布依族苗族自治州", "罗甸县");
            Add("贵州省", "黔南布依族苗族自治州", "长顺县");
            Add("贵州省", "黔南布依族苗族自治州", "龙里县");
            Add("贵州省", "黔南布依族苗族自治州", "惠水县");
            Add("贵州省", "黔南布依族苗族自治州", "三都水族自治县");
            Add("云南省", "昆明市", "五华区");
            Add("云南省", "昆明市", "盘龙区");
            Add("云南省", "昆明市", "官渡区");
            Add("云南省", "昆明市", "西山区");
            Add("云南省", "昆明市", "东川区");
            Add("云南省", "昆明市", "呈贡县");
            Add("云南省", "昆明市", "晋宁县");
            Add("云南省", "昆明市", "富民县");
            Add("云南省", "昆明市", "宜良县");
            Add("云南省", "昆明市", "石林彝族自治县");
            Add("云南省", "昆明市", "嵩明县");
            Add("云南省", "昆明市", "禄劝彝族苗族自治县");
            Add("云南省", "昆明市", "寻甸回族彝族自治县");
            Add("云南省", "昆明市", "安宁市");
            Add("云南省", "曲靖市", "麒麟区");
            Add("云南省", "曲靖市", "马龙县");
            Add("云南省", "曲靖市", "陆良县");
            Add("云南省", "曲靖市", "师宗县");
            Add("云南省", "曲靖市", "罗平县");
            Add("云南省", "曲靖市", "富源县");
            Add("云南省", "曲靖市", "会泽县");
            Add("云南省", "曲靖市", "沾益县");
            Add("云南省", "曲靖市", "宣威市");
            Add("云南省", "玉溪市", "红塔区");
            Add("云南省", "玉溪市", "江川县");
            Add("云南省", "玉溪市", "澄江县");
            Add("云南省", "玉溪市", "通海县");
            Add("云南省", "玉溪市", "华宁县");
            Add("云南省", "玉溪市", "易门县");
            Add("云南省", "玉溪市", "峨山彝族自治县");
            Add("云南省", "玉溪市", "新平彝族傣族自治县");
            Add("云南省", "玉溪市", "元江哈尼族彝族傣族自治县");
            Add("云南省", "昭通地区", "昭通市");
            Add("云南省", "昭通地区", "鲁甸县");
            Add("云南省", "昭通地区", "巧家县");
            Add("云南省", "昭通地区", "盐津县");
            Add("云南省", "昭通地区", "大关县");
            Add("云南省", "昭通地区", "永善县");
            Add("云南省", "昭通地区", "绥江县");
            Add("云南省", "昭通地区", "镇雄县");
            Add("云南省", "昭通地区", "彝良县");
            Add("云南省", "昭通地区", "威信县");
            Add("云南省", "昭通地区", "水富县");
            Add("云南省", "楚雄彝族自治州", "楚雄市");
            Add("云南省", "楚雄彝族自治州", "双柏县");
            Add("云南省", "楚雄彝族自治州", "牟定县");
            Add("云南省", "楚雄彝族自治州", "南华县");
            Add("云南省", "楚雄彝族自治州", "姚安县");
            Add("云南省", "楚雄彝族自治州", "大姚县");
            Add("云南省", "楚雄彝族自治州", "永仁县");
            Add("云南省", "楚雄彝族自治州", "元谋县");
            Add("云南省", "楚雄彝族自治州", "武定县");
            Add("云南省", "楚雄彝族自治州", "禄丰县");
            Add("云南省", "红河哈尼族彝族自治州", "个旧市");
            Add("云南省", "红河哈尼族彝族自治州", "开远市");
            Add("云南省", "红河哈尼族彝族自治州", "蒙自县");
            Add("云南省", "红河哈尼族彝族自治州", "屏边苗族自治县");
            Add("云南省", "红河哈尼族彝族自治州", "建水县");
            Add("云南省", "红河哈尼族彝族自治州", "石屏县");
            Add("云南省", "红河哈尼族彝族自治州", "弥勒县");
            Add("云南省", "红河哈尼族彝族自治州", "泸西县");
            Add("云南省", "红河哈尼族彝族自治州", "元阳县");
            Add("云南省", "红河哈尼族彝族自治州", "红河县");
            Add("云南省", "红河哈尼族彝族自治州", "金平苗族瑶族傣族自治县");
            Add("云南省", "红河哈尼族彝族自治州", "绿春县");
            Add("云南省", "红河哈尼族彝族自治州", "河口瑶族自治县");
            Add("云南省", "文山壮族苗族自治州", "文山县");
            Add("云南省", "文山壮族苗族自治州", "砚山县");
            Add("云南省", "文山壮族苗族自治州", "西畴县");
            Add("云南省", "文山壮族苗族自治州", "麻栗坡县");
            Add("云南省", "文山壮族苗族自治州", "马关县");
            Add("云南省", "文山壮族苗族自治州", "丘北县");
            Add("云南省", "文山壮族苗族自治州", "广南县");
            Add("云南省", "文山壮族苗族自治州", "富宁县");
            Add("云南省", "思茅市", "思茅市");
            Add("云南省", "思茅市", "普洱哈尼族彝族自治县");
            Add("云南省", "思茅市", "墨江哈尼族自治县");
            Add("云南省", "思茅市", "景东彝族自治县");
            Add("云南省", "思茅市", "景谷傣族彝族自治县");
            Add("云南省", "思茅市", "镇沅彝族哈尼族拉祜族自治县");
            Add("云南省", "思茅市", "江城哈尼族彝族自治县");
            Add("云南省", "思茅市", "孟连傣族拉祜族佤族自治县");
            Add("云南省", "思茅市", "澜沧拉祜族自治县");
            Add("云南省", "思茅市", "西盟佤族自治县");
            Add("云南省", "西双版纳傣族自治州", "景洪市");
            Add("云南省", "西双版纳傣族自治州", "勐海县");
            Add("云南省", "西双版纳傣族自治州", "勐腊县");
            Add("云南省", "大理白族自治州", "大理市");
            Add("云南省", "大理白族自治州", "漾濞彝族自治县");
            Add("云南省", "大理白族自治州", "祥云县");
            Add("云南省", "大理白族自治州", "宾川县");
            Add("云南省", "大理白族自治州", "弥渡县");
            Add("云南省", "大理白族自治州", "南涧彝族自治县");
            Add("云南省", "大理白族自治州", "巍山彝族回族自治县");
            Add("云南省", "大理白族自治州", "永平县");
            Add("云南省", "大理白族自治州", "云龙县");
            Add("云南省", "大理白族自治州", "洱源县");
            Add("云南省", "大理白族自治州", "剑川县");
            Add("云南省", "大理白族自治州", "鹤庆县");
            Add("云南省", "保山地区", "保山市");
            Add("云南省", "保山地区", "施甸县");
            Add("云南省", "保山地区", "腾冲县");
            Add("云南省", "保山地区", "龙陵县");
            Add("云南省", "保山地区", "昌宁县");
            Add("云南省", "德宏傣族景颇族自治州", "畹町市");
            Add("云南省", "德宏傣族景颇族自治州", "瑞丽市");
            Add("云南省", "德宏傣族景颇族自治州", "潞西市");
            Add("云南省", "德宏傣族景颇族自治州", "梁河县");
            Add("云南省", "德宏傣族景颇族自治州", "盈江县");
            Add("云南省", "德宏傣族景颇族自治州", "陇川县");
            Add("云南省", "丽江地区", "丽江纳西族自治县");
            Add("云南省", "丽江地区", "永胜县");
            Add("云南省", "丽江地区", "华坪县");
            Add("云南省", "丽江地区", "宁蒗彝族自治县");
            Add("云南省", "怒江傈僳族自治州", "泸水县");
            Add("云南省", "怒江傈僳族自治州", "福贡县");
            Add("云南省", "怒江傈僳族自治州", "贡山独龙族怒族自治县");
            Add("云南省", "怒江傈僳族自治州", "兰坪白族普米族自治县");
            Add("云南省", "迪庆藏族自治州", "中甸县");
            Add("云南省", "迪庆藏族自治州", "德钦县");
            Add("云南省", "迪庆藏族自治州", "维西傈僳族自治县");
            Add("云南省", "临沧地区", "临沧县");
            Add("云南省", "临沧地区", "凤庆县");
            Add("云南省", "临沧地区", "云县");
            Add("云南省", "临沧地区", "永德县");
            Add("云南省", "临沧地区", "镇康县");
            Add("云南省", "临沧地区", "双江拉祜族佤族布朗族傣族自治县");
            Add("云南省", "临沧地区", "耿马傣族佤族自治县");
            Add("云南省", "临沧地区", "沧源佤族自治县");
            Add("西藏省", "拉萨市", "城关区");
            Add("西藏省", "拉萨市", "林周县");
            Add("西藏省", "拉萨市", "当雄县");
            Add("西藏省", "拉萨市", "尼木县");
            Add("西藏省", "拉萨市", "曲水县");
            Add("西藏省", "拉萨市", "堆龙德庆县");
            Add("西藏省", "拉萨市", "达孜县");
            Add("西藏省", "拉萨市", "墨竹工卡县");
            Add("西藏省", "昌都地区", "昌都县");
            Add("西藏省", "昌都地区", "江达县");
            Add("西藏省", "昌都地区", "贡觉县");
            Add("西藏省", "昌都地区", "类乌齐县");
            Add("西藏省", "昌都地区", "丁青县");
            Add("西藏省", "昌都地区", "察雅县");
            Add("西藏省", "昌都地区", "八宿县");
            Add("西藏省", "昌都地区", "左贡县");
            Add("西藏省", "昌都地区", "芒康县");
            Add("西藏省", "昌都地区", "洛隆县");
            Add("西藏省", "昌都地区", "边坝县");
            Add("西藏省", "山南地区", "乃东县");
            Add("西藏省", "山南地区", "扎囊县");
            Add("西藏省", "山南地区", "贡嘎县");
            Add("西藏省", "山南地区", "桑日县");
            Add("西藏省", "山南地区", "琼结县");
            Add("西藏省", "山南地区", "曲松县");
            Add("西藏省", "山南地区", "措美县");
            Add("西藏省", "山南地区", "洛扎县");
            Add("西藏省", "山南地区", "加查县");
            Add("西藏省", "山南地区", "隆子县");
            Add("西藏省", "山南地区", "错那县");
            Add("西藏省", "山南地区", "浪卡子县");
            Add("西藏省", "日喀则地区", "日喀则市");
            Add("西藏省", "日喀则地区", "南木林县");
            Add("西藏省", "日喀则地区", "江孜县");
            Add("西藏省", "日喀则地区", "定日县");
            Add("西藏省", "日喀则地区", "萨迦县");
            Add("西藏省", "日喀则地区", "拉孜县");
            Add("西藏省", "日喀则地区", "昂仁县");
            Add("西藏省", "日喀则地区", "谢通门县");
            Add("西藏省", "日喀则地区", "白朗县");
            Add("西藏省", "日喀则地区", "仁布县");
            Add("西藏省", "日喀则地区", "康马县");
            Add("西藏省", "日喀则地区", "定结县");
            Add("西藏省", "日喀则地区", "仲巴县");
            Add("西藏省", "日喀则地区", "亚东县");
            Add("西藏省", "日喀则地区", "吉隆县");
            Add("西藏省", "日喀则地区", "聂拉木县");
            Add("西藏省", "日喀则地区", "萨嘎县");
            Add("西藏省", "日喀则地区", "岗巴县");
            Add("西藏省", "那曲地区", "那曲县");
            Add("西藏省", "那曲地区", "嘉黎县");
            Add("西藏省", "那曲地区", "比如县");
            Add("西藏省", "那曲地区", "聂荣县");
            Add("西藏省", "那曲地区", "安多县");
            Add("西藏省", "那曲地区", "申扎县");
            Add("西藏省", "那曲地区", "索县");
            Add("西藏省", "那曲地区", "班戈县");
            Add("西藏省", "那曲地区", "巴青县");
            Add("西藏省", "那曲地区", "尼玛县");
            Add("西藏省", "阿里地区", "普兰县");
            Add("西藏省", "阿里地区", "札达县");
            Add("西藏省", "阿里地区", "噶尔县");
            Add("西藏省", "阿里地区", "日土县");
            Add("西藏省", "阿里地区", "革吉县");
            Add("西藏省", "阿里地区", "改则县");
            Add("西藏省", "阿里地区", "措勤县");
            Add("西藏省", "林芝地区", "林芝县");
            Add("西藏省", "林芝地区", "工布江达县");
            Add("西藏省", "林芝地区", "米林县");
            Add("西藏省", "林芝地区", "墨脱县");
            Add("西藏省", "林芝地区", "波密县");
            Add("西藏省", "林芝地区", "察隅县");
            Add("西藏省", "林芝地区", "朗县");
            Add("陕西省", "西安市", "新城区");
            Add("陕西省", "西安市", "碑林区");
            Add("陕西省", "西安市", "莲湖区");
            Add("陕西省", "西安市", "灞桥区");
            Add("陕西省", "西安市", "未央区");
            Add("陕西省", "西安市", "雁塔区");
            Add("陕西省", "西安市", "阎良区");
            Add("陕西省", "西安市", "临潼区");
            Add("陕西省", "西安市", "长安县");
            Add("陕西省", "西安市", "蓝田县");
            Add("陕西省", "西安市", "周至县");
            Add("陕西省", "西安市", "户县");
            Add("陕西省", "西安市", "高陵县");
            Add("陕西省", "铜川市", "城区");
            Add("陕西省", "铜川市", "郊区");
            Add("陕西省", "铜川市", "耀县");
            Add("陕西省", "铜川市", "宜君县");
            Add("陕西省", "宝鸡市", "渭滨区");
            Add("陕西省", "宝鸡市", "金台区");
            Add("陕西省", "宝鸡市", "宝鸡县");
            Add("陕西省", "宝鸡市", "凤翔县");
            Add("陕西省", "宝鸡市", "岐山县");
            Add("陕西省", "宝鸡市", "扶风县");
            Add("陕西省", "宝鸡市", "眉县");
            Add("陕西省", "宝鸡市", "陇县");
            Add("陕西省", "宝鸡市", "千阳县");
            Add("陕西省", "宝鸡市", "麟游县");
            Add("陕西省", "宝鸡市", "凤县");
            Add("陕西省", "宝鸡市", "太白县");
            Add("陕西省", "咸阳市", "秦都区");
            Add("陕西省", "咸阳市", "杨陵区");
            Add("陕西省", "咸阳市", "渭城区");
            Add("陕西省", "咸阳市", "三原县");
            Add("陕西省", "咸阳市", "泾阳县");
            Add("陕西省", "咸阳市", "乾县");
            Add("陕西省", "咸阳市", "礼泉县");
            Add("陕西省", "咸阳市", "永寿县");
            Add("陕西省", "咸阳市", "彬县");
            Add("陕西省", "咸阳市", "长武县");
            Add("陕西省", "咸阳市", "旬邑县");
            Add("陕西省", "咸阳市", "淳化县");
            Add("陕西省", "咸阳市", "武功县");
            Add("陕西省", "咸阳市", "兴平市");
            Add("陕西省", "渭南市", "临渭区");
            Add("陕西省", "渭南市", "华县");
            Add("陕西省", "渭南市", "潼关县");
            Add("陕西省", "渭南市", "大荔县");
            Add("陕西省", "渭南市", "合阳县");
            Add("陕西省", "渭南市", "澄城县");
            Add("陕西省", "渭南市", "蒲城县");
            Add("陕西省", "渭南市", "白水县");
            Add("陕西省", "渭南市", "富平县");
            Add("陕西省", "渭南市", "韩城市");
            Add("陕西省", "渭南市", "华阴市");
            Add("陕西省", "延安市", "宝塔区");
            Add("陕西省", "延安市", "延长县");
            Add("陕西省", "延安市", "延川县");
            Add("陕西省", "延安市", "子长县");
            Add("陕西省", "延安市", "安塞县");
            Add("陕西省", "延安市", "志丹县");
            Add("陕西省", "延安市", "吴旗县");
            Add("陕西省", "延安市", "甘泉县");
            Add("陕西省", "延安市", "富县");
            Add("陕西省", "延安市", "洛川县");
            Add("陕西省", "延安市", "宜川县");
            Add("陕西省", "延安市", "黄龙县");
            Add("陕西省", "延安市", "黄陵县");
            Add("陕西省", "汉中市", "汉台区");
            Add("陕西省", "汉中市", "南郑县");
            Add("陕西省", "汉中市", "城固县");
            Add("陕西省", "汉中市", "洋县");
            Add("陕西省", "汉中市", "西乡县");
            Add("陕西省", "汉中市", "勉县");
            Add("陕西省", "汉中市", "宁强县");
            Add("陕西省", "汉中市", "略阳县");
            Add("陕西省", "汉中市", "镇巴县");
            Add("陕西省", "汉中市", "留坝县");
            Add("陕西省", "汉中市", "佛坪县");
            Add("陕西省", "安康地区", "安康市");
            Add("陕西省", "安康地区", "汉阴县");
            Add("陕西省", "安康地区", "石泉县");
            Add("陕西省", "安康地区", "宁陕县");
            Add("陕西省", "安康地区", "紫阳县");
            Add("陕西省", "安康地区", "岚皋县");
            Add("陕西省", "安康地区", "平利县");
            Add("陕西省", "安康地区", "镇坪县");
            Add("陕西省", "安康地区", "旬阳县");
            Add("陕西省", "安康地区", "白河县");
            Add("陕西省", "商洛地区", "商州市");
            Add("陕西省", "商洛地区", "洛南县");
            Add("陕西省", "商洛地区", "丹凤县");
            Add("陕西省", "商洛地区", "商南县");
            Add("陕西省", "商洛地区", "山阳县");
            Add("陕西省", "商洛地区", "镇安县");
            Add("陕西省", "商洛地区", "柞水县");
            Add("陕西省", "榆林地区", "榆林市");
            Add("陕西省", "榆林地区", "神木县");
            Add("陕西省", "榆林地区", "府谷县");
            Add("陕西省", "榆林地区", "横山县");
            Add("陕西省", "榆林地区", "靖边县");
            Add("陕西省", "榆林地区", "定边县");
            Add("陕西省", "榆林地区", "绥德县");
            Add("陕西省", "榆林地区", "米脂县");
            Add("陕西省", "榆林地区", "佳县");
            Add("陕西省", "榆林地区", "吴堡县");
            Add("陕西省", "榆林地区", "清涧县");
            Add("陕西省", "榆林地区", "子洲县");
            Add("甘肃省", "兰州市", "城关区");
            Add("甘肃省", "兰州市", "七里河区");
            Add("甘肃省", "兰州市", "西固区");
            Add("甘肃省", "兰州市", "安宁区");
            Add("甘肃省", "兰州市", "红古区");
            Add("甘肃省", "兰州市", "永登县");
            Add("甘肃省", "兰州市", "皋兰县");
            Add("甘肃省", "兰州市", "榆中县");
            Add("甘肃省", "嘉峪关市", "市辖区");
            Add("甘肃省", "金昌市", "金川区");
            Add("甘肃省", "金昌市", "永昌县");
            Add("甘肃省", "白银市", "白银区");
            Add("甘肃省", "白银市", "平川区");
            Add("甘肃省", "白银市", "靖远县");
            Add("甘肃省", "白银市", "会宁县");
            Add("甘肃省", "白银市", "景泰县");
            Add("甘肃省", "天水市", "秦城区");
            Add("甘肃省", "天水市", "北道区");
            Add("甘肃省", "天水市", "清水县");
            Add("甘肃省", "天水市", "秦安县");
            Add("甘肃省", "天水市", "甘谷县");
            Add("甘肃省", "天水市", "武山县");
            Add("甘肃省", "天水市", "张家川回族自治县");
            Add("甘肃省", "酒泉地区", "玉门市");
            Add("甘肃省", "酒泉地区", "酒泉市");
            Add("甘肃省", "酒泉地区", "敦煌市");
            Add("甘肃省", "酒泉地区", "金塔县");
            Add("甘肃省", "酒泉地区", "肃北蒙古族自治县");
            Add("甘肃省", "酒泉地区", "阿克塞哈萨克族自治县");
            Add("甘肃省", "酒泉地区", "安西县");
            Add("甘肃省", "张掖地区", "张掖市");
            Add("甘肃省", "张掖地区", "肃南裕固族自治县");
            Add("甘肃省", "张掖地区", "民乐县");
            Add("甘肃省", "张掖地区", "临泽县");
            Add("甘肃省", "张掖地区", "高台县");
            Add("甘肃省", "张掖地区", "山丹县");
            Add("甘肃省", "武威地区", "武威市");
            Add("甘肃省", "武威地区", "民勤县");
            Add("甘肃省", "武威地区", "古浪县");
            Add("甘肃省", "武威地区", "天祝藏族自治县");
            Add("甘肃省", "定西地区", "定西县");
            Add("甘肃省", "定西地区", "通渭县");
            Add("甘肃省", "定西地区", "陇西县");
            Add("甘肃省", "定西地区", "渭源县");
            Add("甘肃省", "定西地区", "临洮县");
            Add("甘肃省", "定西地区", "漳县");
            Add("甘肃省", "定西地区", "岷县");
            Add("甘肃省", "陇南地区", "武都县");
            Add("甘肃省", "陇南地区", "宕昌县");
            Add("甘肃省", "陇南地区", "成县");
            Add("甘肃省", "陇南地区", "康县");
            Add("甘肃省", "陇南地区", "文县");
            Add("甘肃省", "陇南地区", "西和县");
            Add("甘肃省", "陇南地区", "礼县");
            Add("甘肃省", "陇南地区", "两当县");
            Add("甘肃省", "陇南地区", "徽县");
            Add("甘肃省", "平凉地区", "平凉市");
            Add("甘肃省", "平凉地区", "泾川县");
            Add("甘肃省", "平凉地区", "灵台县");
            Add("甘肃省", "平凉地区", "崇信县");
            Add("甘肃省", "平凉地区", "华亭县");
            Add("甘肃省", "平凉地区", "庄浪县");
            Add("甘肃省", "平凉地区", "静宁县");
            Add("甘肃省", "庆阳地区", "西峰市");
            Add("甘肃省", "庆阳地区", "庆阳县");
            Add("甘肃省", "庆阳地区", "环县");
            Add("甘肃省", "庆阳地区", "华池县");
            Add("甘肃省", "庆阳地区", "合水县");
            Add("甘肃省", "庆阳地区", "正宁县");
            Add("甘肃省", "庆阳地区", "宁县");
            Add("甘肃省", "庆阳地区", "镇原县");
            Add("甘肃省", "临夏回族自治州", "临夏市");
            Add("甘肃省", "临夏回族自治州", "临夏县");
            Add("甘肃省", "临夏回族自治州", "康乐县");
            Add("甘肃省", "临夏回族自治州", "永靖县");
            Add("甘肃省", "临夏回族自治州", "广河县");
            Add("甘肃省", "临夏回族自治州", "和政县");
            Add("甘肃省", "临夏回族自治州", "东乡族自治县");
            Add("甘肃省", "临夏回族自治州", "积石山保安族东乡族撒拉族自治县");
            Add("甘肃省", "甘南藏族自治州", "合作市");
            Add("甘肃省", "甘南藏族自治州", "临潭县");
            Add("甘肃省", "甘南藏族自治州", "卓尼县");
            Add("甘肃省", "甘南藏族自治州", "舟曲县");
            Add("甘肃省", "甘南藏族自治州", "迭部县");
            Add("甘肃省", "甘南藏族自治州", "玛曲县");
            Add("甘肃省", "甘南藏族自治州", "碌曲县");
            Add("甘肃省", "甘南藏族自治州", "夏河县");
            Add("青海省", "西宁市", "城东区");
            Add("青海省", "西宁市", "城中区");
            Add("青海省", "西宁市", "城西区");
            Add("青海省", "西宁市", "城北区");
            Add("青海省", "西宁市", "大通回族土族自治县");
            Add("青海省", "海东地区", "平安县");
            Add("青海省", "海东地区", "民和回族土族自治县");
            Add("青海省", "海东地区", "乐都县");
            Add("青海省", "海东地区", "湟中县");
            Add("青海省", "海东地区", "湟源县");
            Add("青海省", "海东地区", "互助土族自治县");
            Add("青海省", "海东地区", "化隆回族自治县");
            Add("青海省", "海东地区", "循化撒拉族自治县");
            Add("青海省", "海北藏族自治州", "门源回族自治县");
            Add("青海省", "海北藏族自治州", "祁连县");
            Add("青海省", "海北藏族自治州", "海晏县");
            Add("青海省", "海北藏族自治州", "刚察县");
            Add("青海省", "黄南藏族自治州", "同仁县");
            Add("青海省", "黄南藏族自治州", "尖扎县");
            Add("青海省", "黄南藏族自治州", "泽库县");
            Add("青海省", "黄南藏族自治州", "河南蒙古族自治县");
            Add("青海省", "海南藏族自治州", "共和县");
            Add("青海省", "海南藏族自治州", "同德县");
            Add("青海省", "海南藏族自治州", "贵德县");
            Add("青海省", "海南藏族自治州", "兴海县");
            Add("青海省", "海南藏族自治州", "贵南县");
            Add("青海省", "果洛藏族自治州", "玛沁县");
            Add("青海省", "果洛藏族自治州", "班玛县");
            Add("青海省", "果洛藏族自治州", "甘德县");
            Add("青海省", "果洛藏族自治州", "达日县");
            Add("青海省", "果洛藏族自治州", "久治县");
            Add("青海省", "果洛藏族自治州", "玛多县");
            Add("青海省", "玉树藏族自治州", "玉树县");
            Add("青海省", "玉树藏族自治州", "杂多县");
            Add("青海省", "玉树藏族自治州", "称多县");
            Add("青海省", "玉树藏族自治州", "治多县");
            Add("青海省", "玉树藏族自治州", "囊谦县");
            Add("青海省", "玉树藏族自治州", "曲麻莱县");
            Add("青海省", "海西蒙古族藏族自治州", "格尔木市");
            Add("青海省", "海西蒙古族藏族自治州", "德令哈市");
            Add("青海省", "海西蒙古族藏族自治州", "乌兰县");
            Add("青海省", "海西蒙古族藏族自治州", "都兰县");
            Add("青海省", "海西蒙古族藏族自治州", "天峻县");
            Add("宁夏省", "银川市", "兴庆区");
            Add("宁夏省", "银川市", "西夏区");
            Add("宁夏省", "银川市", "金凤区");
            Add("宁夏省", "银川市", "永宁县");
            Add("宁夏省", "银川市", "贺兰县");
            Add("宁夏省", "银川市", " 灵武市");
            Add("宁夏省", "石嘴山市", "大武口区");
            Add("宁夏省", "石嘴山市", "惠农区");
            Add("宁夏省", "石嘴山市", "平罗县");
            Add("宁夏省", "吴忠市", "利通区");
            Add("宁夏省", "吴忠市", "　红寺堡区");
            Add("宁夏省", "吴忠市", "盐池县");
            Add("宁夏省", "吴忠市", "同心县");
            Add("宁夏省", "吴忠市", "青铜峡市");
            Add("宁夏省", "固原地区", "原州区");
            Add("宁夏省", "固原地区", "西吉县");
            Add("宁夏省", "固原地区", "隆德县");
            Add("宁夏省", "固原地区", "泾源县");
            Add("宁夏省", "固原地区", "彭阳县");
            Add("宁夏省", "中 卫 市", "沙坡头区");
            Add("宁夏省", "中 卫 市", " 中宁县");
            Add("宁夏省", "中 卫 市", "海原县");
            Add("新疆省", "乌鲁木齐市", "天山区");
            Add("新疆省", "乌鲁木齐市", "沙依巴克区");
            Add("新疆省", "乌鲁木齐市", "新市区");
            Add("新疆省", "乌鲁木齐市", "水磨沟区");
            Add("新疆省", "乌鲁木齐市", "头屯河区");
            Add("新疆省", "乌鲁木齐市", "南山矿区");
            Add("新疆省", "乌鲁木齐市", "东山区");
            Add("新疆省", "乌鲁木齐市", "乌鲁木齐县");
            Add("新疆省", "克拉玛依市", "独山子区");
            Add("新疆省", "克拉玛依市", "克拉玛依区");
            Add("新疆省", "克拉玛依市", "白碱滩区");
            Add("新疆省", "克拉玛依市", "乌尔禾区");
            Add("新疆省", "吐鲁番地区", "吐鲁番市");
            Add("新疆省", "吐鲁番地区", "鄯善县");
            Add("新疆省", "吐鲁番地区", "托克逊县");
            Add("新疆省", "哈密地区", "哈密市");
            Add("新疆省", "哈密地区", "巴里坤哈萨克自治县");
            Add("新疆省", "哈密地区", "伊吾县");
            Add("新疆省", "昌吉回族自治州", "昌吉市");
            Add("新疆省", "昌吉回族自治州", "阜康市");
            Add("新疆省", "昌吉回族自治州", "呼图壁县");
            Add("新疆省", "昌吉回族自治州", "玛纳斯县");
            Add("新疆省", "昌吉回族自治州", "奇台县");
            Add("新疆省", "昌吉回族自治州", "吉木萨尔县");
            Add("新疆省", "昌吉回族自治州", "木垒哈萨克自治县");
            Add("新疆省", "博尔塔拉蒙古自治州", "博乐市");
            Add("新疆省", "博尔塔拉蒙古自治州", "精河县");
            Add("新疆省", "博尔塔拉蒙古自治州", "温泉县");
            Add("新疆省", "巴音郭楞蒙古自治州", "库尔勒市");
            Add("新疆省", "巴音郭楞蒙古自治州", "轮台县");
            Add("新疆省", "巴音郭楞蒙古自治州", "尉犁县");
            Add("新疆省", "巴音郭楞蒙古自治州", "若羌县");
            Add("新疆省", "巴音郭楞蒙古自治州", "且末县");
            Add("新疆省", "巴音郭楞蒙古自治州", "焉耆回族自治县");
            Add("新疆省", "巴音郭楞蒙古自治州", "和静县");
            Add("新疆省", "巴音郭楞蒙古自治州", "和硕县");
            Add("新疆省", "巴音郭楞蒙古自治州", "博湖县");
            Add("新疆省", "阿克苏地区", "阿克苏市");
            Add("新疆省", "阿克苏地区", "温宿县");
            Add("新疆省", "阿克苏地区", "库车县");
            Add("新疆省", "阿克苏地区", "沙雅县");
            Add("新疆省", "阿克苏地区", "新和县");
            Add("新疆省", "阿克苏地区", "拜城县");
            Add("新疆省", "阿克苏地区", "乌什县");
            Add("新疆省", "阿克苏地区", "阿瓦提县");
            Add("新疆省", "阿克苏地区", "柯坪县");
            Add("新疆省", "克孜勒苏柯尔克孜自治州", "阿图什市");
            Add("新疆省", "克孜勒苏柯尔克孜自治州", "阿克陶县");
            Add("新疆省", "克孜勒苏柯尔克孜自治州", "阿合奇县");
            Add("新疆省", "克孜勒苏柯尔克孜自治州", "乌恰县");
            Add("新疆省", "喀什地区", "喀什市");
            Add("新疆省", "喀什地区", "疏附县");
            Add("新疆省", "喀什地区", "疏勒县");
            Add("新疆省", "喀什地区", "英吉沙县");
            Add("新疆省", "喀什地区", "泽普县");
            Add("新疆省", "喀什地区", "莎车县");
            Add("新疆省", "喀什地区", "叶城县");
            Add("新疆省", "喀什地区", "麦盖提县");
            Add("新疆省", "喀什地区", "岳普湖县");
            Add("新疆省", "喀什地区", "伽师县");
            Add("新疆省", "喀什地区", "巴楚县");
            Add("新疆省", "喀什地区", "塔什库尔干塔吉克自治县");
            Add("新疆省", "和田地区", "和田市");
            Add("新疆省", "和田地区", "和田县");
            Add("新疆省", "和田地区", "墨玉县");
            Add("新疆省", "和田地区", "皮山县");
            Add("新疆省", "和田地区", "洛浦县");
            Add("新疆省", "和田地区", "策勒县");
            Add("新疆省", "和田地区", "于田县");
            Add("新疆省", "和田地区", "民丰县");
            Add("新疆省", "伊犁哈萨克自治州", "奎屯市");
            Add("新疆省", "伊犁哈萨克自治州", "伊犁地区");
            Add("新疆省", "伊犁哈萨克自治州", "伊宁市");
            Add("新疆省", "伊犁哈萨克自治州", "伊宁县");
            Add("新疆省", "伊犁哈萨克自治州", "察布查尔锡伯自治县");
            Add("新疆省", "伊犁哈萨克自治州", "霍城县");
            Add("新疆省", "伊犁哈萨克自治州", "巩留县");
            Add("新疆省", "伊犁哈萨克自治州", "新源县");
            Add("新疆省", "伊犁哈萨克自治州", "昭苏县");
            Add("新疆省", "伊犁哈萨克自治州", "特克斯县");
            Add("新疆省", "伊犁哈萨克自治州", "尼勒克县");
            Add("新疆省", "塔城地区", "塔城市");
            Add("新疆省", "塔城地区", "乌苏市");
            Add("新疆省", "塔城地区", "额敏县");
            Add("新疆省", "塔城地区", "沙湾县");
            Add("新疆省", "塔城地区", "托里县");
            Add("新疆省", "塔城地区", "裕民县");
            Add("新疆省", "塔城地区", "和布克赛尔蒙古自治县");
            Add("新疆省", "阿勒泰地区", "阿勒泰市");
            Add("新疆省", "阿勒泰地区", "布尔津县");
            Add("新疆省", "阿勒泰地区", "富蕴县");
            Add("新疆省", "阿勒泰地区", "福海县");
            Add("新疆省", "阿勒泰地区", "哈巴河县");
            Add("新疆省", "阿勒泰地区", "青河县");
            Add("新疆省", "阿勒泰地区", "吉木乃县");
            Add("新疆省", "省直辖行政单位", "石河子市");
            Add("新疆省", "省直辖行政单位", "阿拉尔市");
            Add("新疆省", "省直辖行政单位", "图木舒克市");
            Add("新疆省", "省直辖行政单位", "五家渠市");
        }
        Dictionary<string, Dictionary<string, List<String>>> data = new Dictionary<string, Dictionary<string, List<string>>>();
        /// <summary>
        /// 判断并添加
        /// </summary>
        /// <param name="provence"></param>
        /// <param name="city"></param>
        /// <param name="county"></param>
        public void Add(string provence, string city, string county)
        {
            Init(data, provence, city);
            if (IsUsingCounty)
            {
               data[provence][city].Add(county);
            }
        }

        public static void Init(Dictionary<string, Dictionary<string, List<String>>> data, string provence, string city)
        {
            if (!data.ContainsKey(provence)) data[provence] = new Dictionary<string, List<string>>();
            if (!data[provence].ContainsKey(city)) data[provence][city] = new List<string>();
        }

    }
}
